
Процедура СоздатьЗадачу(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение, ИнформацияОФайле = Неопределено, Ошибка = Ложь)
	
	// Этапы создания задачи:
	// 1. Выберите вариант создания (Краткий, Подробный, Бэклог, ТехПоддержка)
	// 2. Укажите цель задачи
	// 3. + Подробное описание задачи (вариант "Подробный", в "Кратком" и "Бэклоге"- не заполнено)
	// 4. - Выберите организацию (Выбор вариантов)  - пропускаем
	// 5. + Выберите исполнителя (Выбор вариантов) (вариант "Подробный" и "ТехПоддержка", в "Кратком" = Текущему пользователю)
	// 6. + Выберите контролирующее лицо (вариант "Подробный", в "Кратком" - не заполнено, в "ТехПоддержке" - группа для оповещения)
	// 7. Приступить к задаче немедленно (Выбор из вариантов "Да|Нет") 
	// 8. Выберите задача периодическая или нет (Выбор из вариантов "Да|Нет")
	// 8. Укажите дату начала задачи (выбор даты, если "Немедленно","Периодичная","Бэклог" или "ТехПоддержка" - начало тек.минуты)
	// 9. + Укажите срок исполнения задачи ("Подробный" - выбор даты, "Периодичная" - ввод продолжительности задачи (мин), в "Кратком" +15 минут от даты начала, "Бэклог" или "ТехПоддержка" +5 минут от даты начала)
	// 10. + Прикрепите файлы (или Пропустить) (вариант "Подробный" и "ТехПоддержка")
	
	СтрокаИнтернетОтвета = "⭐ Создать задачу
	|➡️ На кого будем ставить задачу:
	|<b>На себя (Кратко)</b> - краткое описание задачи.
	|<b>На себя (Подробно)</b> - подробное описание задачи с выбором контролирущего сотрудника на себя.
	|<b>На себя (Периодично)</b> - после остановки задачи не нужно завершать задачу и возможно настроить время напоминания о задаче.
	|<b>На сотрудника</b> -  задача на группу или сотрудника с выбором контролирущего сотрудника";
	СтрокаИнтернетОтвета2 = "";
	reply_markup = "";
	ОтправитьКалендарь = Ложь;
	ОтправитьНачалоРаботы = Ложь;
	Сотрудник = ПолучитьСотрудникаПоTelegramId(TelegramId); 
	ВыполнитьСтартЗадачи = Ложь;
	
	Данные = Новый Структура("Тип,Цель,ЦельПодробно,Исполнитель,Группа,ДопКонтроль,Немедленно,Дата,СрокИсполнения,Задача,Файлы, Организация");
	
	Если Не ТекущийЗапрос = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(Данные,ТекущийЗапрос.Данные); 
		
		Если ЗначениеЗаполнено(Данные.Тип) Тогда
			
			Выполнить("СоздатьЗадачу"+ТекущийЗапрос.Данные.Тип+"(ИмяБота,TelegramId,MessageId,ТекущийЗапрос,Сообщение,ИнформацияОФайле,Ошибка)");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийЗапрос = Неопределено Тогда
		
		ТекущийЗапрос = Новый Структура("Команда,Стадия,Данные","СоздатьЗадачу",0,Данные);
	КонецЕсли;     
	
	Если ТекущийЗапрос.Стадия = 0 Тогда			// выбор "Вариант создания"
		#Область ВыборВариантаСозданияЗадачи
		
		Данные.Тип = Неопределено;
		Данные.Цель = Неопределено;
		Данные.ЦельПодробно = Неопределено;
		Данные.Исполнитель = Неопределено;
		Данные.Группа = Неопределено;
		Данные.ДопКонтроль = Неопределено;
		Данные.Немедленно = Неопределено;
		Данные.Дата = Неопределено;
		Данные.СрокИсполнения = Неопределено;
		Данные.Задача = Неопределено;
		Данные.Файлы = Неопределено;
		
		// Укажем "Вариант создания"
		СтрокаИнтернетОтвета2 = "➡ Выберите вариант создания:";
		
		IK = СоздатьInlineKeyboard();
		
		IK.ЗаписатьНачалоМассива();                  
		ДобавитьInlineКнопку(IK, "На себя (Кратко)", "НаСебяКратко");
		IK.ЗаписатьКонецМассива();                            
		
		IK.ЗаписатьНачалоМассива();                           	
		ДобавитьInlineКнопку(IK, "На себя (Подробно)", "НаСебяПодробно");
		ДобавитьInlineКнопку(IK, "На себя (Периодично)", "НаСебяПериодично");
		IK.ЗаписатьКонецМассива();
		
		IK.ЗаписатьНачалоМассива();                  
		ДобавитьInlineКнопку(IK, "На сотрудника", "НаСотрудника");
		IK.ЗаписатьКонецМассива();
		
		reply_markup = ДобавитьInlineКнопкуОтменить(IK);  
		#КонецОбласти
		ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",1,Данные);
	ИначеЕсли ТекущийЗапрос.Стадия = 1 Тогда	// выбрали "Вариант создания"
		
		ТекущийЗапрос.Данные.Тип = Сообщение;  
		СоздатьЗадачу(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, "");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Организация) Тогда
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Организация:</b> " + Данные.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Цель) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Цель:</b> " + Данные.Цель;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ЦельПодробно) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Цель (подробно):</b> " + Данные.ЦельПодробно;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Исполнитель) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Исполнитель:</b> " + Данные.Исполнитель;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Группа) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Группа:</b> " + Данные.Группа;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ДопКонтроль) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ На контроле:</b> " + Данные.ДопКонтроль;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Дата) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Дата:</b> " + Данные.Дата;		
	КонецЕсли;                                                                                      
	
	Если Данные.Свойство("Файлы") 
		И Данные.Файлы <> Неопределено 
		И Данные.Файлы.Количество() Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Прикрепленные файлы:</b> " + Данные.Файлы.Количество();		
	КонецЕсли;
	
	СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + СтрокаИнтернетОтвета2;	
	
	ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId);	
	ОтправитьВTelegramText(ИмяБота, TelegramId, 0, СтрокаИнтернетОтвета, reply_markup, Истина);		
	
	Если ОтправитьНачалоРаботы Тогда
		
		НачалоРаботы(ИмяБота,TelegramId);
	КонецЕсли;  
	
	Если ВыполнитьСтартЗадачи Тогда
		
		ОбщийСервер.СтартЗадачи(Данные.Задача,,,Истина,Истина);     
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗадачуНаСебяКратко(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение, ИнформацияОФайле = Неопределено, Ошибка = Ложь)
	
	СтрокаИнтернетОтвета = "⭐ Создать задачу";
	СтрокаИнтернетОтвета2 = "";
	reply_markup = "";
	ОтправитьКалендарь = Ложь;
	ОтправитьНачалоРаботы = Ложь;
	Сотрудник = ПолучитьСотрудникаПоTelegramId(TelegramId); 
	ВыполнитьСтартЗадачи = Ложь;
	
	Данные = Новый Структура("Тип,Цель,ЦельПодробно,Исполнитель,Группа,ДопКонтроль,Немедленно,Дата,СрокИсполнения,Задача,Файлы, Организация");
	
	Если Не ТекущийЗапрос = Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(Данные,ТекущийЗапрос.Данные);
	КонецЕсли;
	
	Если ТекущийЗапрос = Неопределено Тогда
		
		ТекущийЗапрос = Новый Структура("Команда,Стадия,Данные","СоздатьЗадачу",0,Данные);
	КонецЕсли;     
	
	Если ТекущийЗапрос.Стадия = 1 Тогда  
		#Область ВводЦелиКратко
		Данные.Цель = Неопределено;
		Данные.ЦельПодробно = Неопределено;
		Данные.Исполнитель = ПараметрыСеанса.Сотрудник;
		Данные.Группа = Неопределено;
		Данные.ДопКонтроль = Неопределено;
		Данные.Немедленно = Неопределено;
		Данные.Дата = Неопределено;
		Данные.СрокИсполнения = Неопределено;
		Данные.Задача = Неопределено;
		Данные.Файлы = Неопределено;
		
		ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",2,Данные);
		
		// Укажем "Цель (кратко)"
		СтрокаИнтернетОтвета2 = "➡ Укажите цель (кратко): ";
		
		reply_markup = ДобавитьОсновныеInlineКнопки();	  
		#КонецОбласти
	ИначеЕсли ТекущийЗапрос.Стадия = 2 Тогда
		#Область ВыборПлательщика
		Данные.Цель = Сообщение;
		Данные.Организация = Неопределено;	
		Данные.Группа = Неопределено;
		Данные.ДопКонтроль = Неопределено;
		Данные.Немедленно = Неопределено;
		Данные.Дата = Неопределено;
		Данные.СрокИсполнения = Неопределено;
		Данные.Задача = Неопределено;
		Данные.Файлы = Неопределено;
		
		// Укажем "Организацию"
		СтрокаИнтернетОтвета2 = "➡ Выберите плательщика:";
		
		Клиенты = Справочники.Клиенты.ПолучитьСписокДоступныхПользователюКлиентов(ПараметрыСеанса.ТекущееПространство, ПараметрыСеанса.Сотрудник);
		
		Если Клиенты.Количество() = 1 Тогда
			Данные.Организация = Клиенты[0].Ссылка;
			ТекущийЗапрос.Стадия = 3;
			ТекущийЗапрос.Данные = Данные;
			СоздатьЗадачу(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение, ИнформацияОФайле, Ошибка);
			Возврат;
		КонецЕсли;
		
		Если Клиенты.Количество() = 0 Тогда 
			
			// Добавление клиента      
			ПереходНаКоманду = Новый Структура("Команда,ИмяБота,TelegramId, MessageId, ТекущийЗапрос, Сообщение","СоздатьЗадачу",ИмяБота,TelegramId, MessageId, ТекущийЗапрос, Сообщение);
			ПлательщикиДобавить(ИмяБота, TelegramId, MessageId, Неопределено, "",ПереходНаКоманду);
			Возврат;
		КонецЕсли;       
		
		IK = СоздатьInlineKeyboard();
		
		Для Каждого Клиент ИЗ Клиенты Цикл
			
			IK.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(IK, Строка(Клиент), Строка(Клиент.УникальныйИдентификатор()));
			IK.ЗаписатьКонецМассива();			
		КонецЦикла;
		
		reply_markup = ДобавитьОсновныеInlineКнопки(IK);
		
		ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",3,Данные);		
		#КонецОбласти  
	ИначеЕсли ТекущийЗапрос.Стадия = 3 Тогда
		#Область ВыборНачалаЗадачи
		
		Если Данные.Организация = Неопределено Тогда
			Данные.Организация = Справочники.Клиенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Сообщение));
		КонецЕсли;
		
		СтрокаИнтернетОтвета2 = "➡ Приступить к выполнению задачи?
		|Если выбираем Нет, то выбираем дату и время начала выполнения задачи (уведомление к выполнению задачи придет за 15 минут).";
		
		IK = СоздатьInlineKeyboard();  		
		
		IK.ЗаписатьНачалоМассива();
		ДобавитьInlineКнопку(IK, "Да", 1);
		ДобавитьInlineКнопку(IK, "Нет", 0);
		IK.ЗаписатьКонецМассива();
		
		reply_markup = ДобавитьОсновныеInlineКнопки(IK);    
		ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",31,Данные);
		#КонецОбласти           
	ИначеЕсли ТекущийЗапрос.Стадия = 31 Тогда
		#Область ЗапускЗадачиИлиВыборДатыНачала
		Данные.Немедленно = ?(Сообщение = "1",Истина,Ложь);  
		
		Если Данные.Немедленно Тогда
			
			Данные.Дата = НачалоМинуты(ТекущаяДата());                                          
			ТекущийЗапрос.Стадия = 5;
			ТекущийЗапрос.Данные = Данные;
			
			СоздатьЗадачу(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение, ИнформацияОФайле, Ошибка);  
			Возврат;
		Иначе
			
			День3 = ДеньНедели(ТекущаяДата()+(86400*3));
			
			Смещение = 0;
			Если День3 = 6 Тогда
				
				Смещение = -1;
			ИначеЕсли День3 = 7 Тогда
				
				Смещение = 1;
			КонецЕсли;       
			
			Смещение3дн = 86400*(3+Смещение);
			
			IK = СоздатьInlineKeyboard();  		
			
			IK.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(IK, "\ud83d\udcc5 Календарь", "manual");
			IK.ЗаписатьКонецМассива();
			
			IK.ЗаписатьНачалоМассива();       
			Дата7 = ТекущаяДата() + (86400*7);
			ДобавитьInlineКнопку(IK, "Через неделю ("+ День(Дата7)+"."+Месяц(Дата7)+")", Строка(86400*7));  
			
			ДатаМес = ДобавитьМесяц(ТекущаяДата(),1);
			ДобавитьInlineКнопку(IK, "Через месяц (" + День(ДатаМес)+"."+Месяц(ДатаМес)+")", Строка(ДатаМес-ТекущаяДата()));
			IK.ЗаписатьКонецМассива();   
			
			IK.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(IK, "Завтра", 86400); 
			
			День3дн = ТекущаяДата()+Смещение3дн;
			ДеньСтрокой = Формат(День3дн,"ДФ=дддд");		
			ДеньСтрокой = ВРег(Лев(ДеньСтрокой,1)) + Прав(ДеньСтрокой,СтрДлина(ДеньСтрокой)-1);
			
			ДобавитьInlineКнопку(IK, ДеньСтрокой + " ("+День(День3Дн)+"."+Месяц(День3Дн)+")", Строка(Смещение3дн));
			IK.ЗаписатьКонецМассива();
			
			IK.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(IK, "\ud83d\udca5 Сегодня", 0);
			IK.ЗаписатьКонецМассива();
			
			СтрокаИнтернетОтвета2 = "➡ Выберите дату начала:";      
			reply_markup = ДобавитьОсновныеInlineКнопки(IK);    
			
			ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",4,Данные);
			
		КонецЕсли;
		#КонецОбласти	
	ИначеЕсли ТекущийЗапрос.Стадия = 4 Тогда
		#Область ВыборДатыНачала
		
		Если Сообщение = "manual" Тогда
			
			СообщениеКалендаря = Неопределено;
			ОтправитьКалендарь = Истина;
			ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",5,Данные);	 
		Иначе
			
			Данные.Дата = ТекущаяДата() + ОбщийСервер.СтрокаВЧисло(Сообщение);
			
			ТекущийЗапрос.Стадия = 5; 
			ТекущийЗапрос.Данные = Данные;
			СоздатьЗадачу(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, "", ИнформацияОФайле, Ошибка);
			Возврат;			
		КонецЕсли;
		
		#КонецОбласти      
	ИначеЕсли ТекущийЗапрос.Стадия = 5 Тогда
		#Область ЗапускЗадачи
		
		Если Сообщение = "0" Тогда
			
			СообщениеКалендаря = Неопределено;
			ОтправитьКалендарь = Истина;
			ДобавитьВТекущийЗапрос(ИмяБота,TelegramId,"СоздатьЗадачу",5,Данные);
			
		Иначе
			
			Если Данные.Дата = Неопределено Тогда
				
				
				Данные.Дата = Дата(1,1,1) + Число(Сообщение);
			КонецЕсли;
			
			Данные.СрокИсполнения = Данные.Дата + (5*60);
			Попытка
				НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
				
				Док = Документы.Задача.СоздатьДокумент();
				Док.Заполнить(Неопределено);
				
				Док.Пространство	= ПараметрыСеанса.ТекущееПространство;
				Док.Автор			= ПараметрыСеанса.Сотрудник;
				Док.Цель			= Данные.Цель;
				Док.ЦельПодробно	= Данные.ЦельПодробно;
				Док.Организация		= Данные.Организация;
				Док.Исполнитель		= Данные.Исполнитель;
				Док.Группа			= Данные.Группа;
				Док.Дата			= Данные.Дата;
				Док.СрокИсполнения	= Данные.СрокИсполнения;
				Док.ТипЗадачи	= Перечисления.ТипыЗадач.Обычная;
				
				Док.Записать(РежимЗаписиДокумента.Запись);
				
				Данные.Задача = Док.Ссылка;
				ЗафиксироватьТранзакцию();
				
			Исключение
				С = ОписаниеОшибки();
				ОтменитьТранзакцию();
			КонецПопытки;   
			
			Если Данные.Немедленно Тогда
				
				ВыполнитьСтартЗадачи = Истина;
			Иначе
				ОтправитьНачалоРаботы = Истина;      
			КонецЕсли;   
			
			СтрокаИнтернетОтвета2 = "✌ Задача успешно создана";
			
			УдалитьТекущийЗапрос(ИмяБота, TelegramId);
		КонецЕсли;
		#КонецОбласти
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Данные.Тип) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Тип задачи:</b> " + СтроковыеФункцииКлиентСервер.ДобавитьПробелыМеждуСловСВерхнимРегистром(Данные.Тип, Истина);		
	КонецЕсли;     	
	
	Если ЗначениеЗаполнено(Данные.Цель) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Цель:</b> " + Данные.Цель;		
	КонецЕсли;     
	
	Если ЗначениеЗаполнено(Данные.Организация) Тогда
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Организация:</b> " + Данные.Организация;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Исполнитель) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Исполнитель:</b> " + Данные.Исполнитель;		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Дата) Тогда
		
		СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + "<b>✔ Дата:</b> " + Данные.Дата;		
	КонецЕсли;                                                                                      
	
	СтрокаИнтернетОтвета = СтрокаИнтернетОтвета + Символы.ПС + СтрокаИнтернетОтвета2;	
	
	ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId);
	
	Если ОтправитьКалендарь Тогда
		
		ОткрытьВремя(ИмяБота, TelegramId, 0, СообщениеКалендаря, СтрокаИнтернетОтвета);
	Иначе
		ОтправитьВTelegramText(ИмяБота, TelegramId, 0, СтрокаИнтернетОтвета, reply_markup, Истина);		
	КонецЕсли;
	
	Если ОтправитьНачалоРаботы Тогда
		
		НачалоРаботы(ИмяБота,TelegramId);
	КонецЕсли;  
	
	Если ВыполнитьСтартЗадачи Тогда
		
		ОбщийСервер.СтартЗадачи(Данные.Задача,,,Истина,Истина);     
	КонецЕсли;
	
КонецПроцедуры


Процедура ОтчетностьМеню(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение)
	
	СтрокаИнтернетОтвета = "Выберите действие:"
	+Символы.ПС + "⏰ <b>Тайминг дня</b> - показывает распределение времени сотрудников на выполнение поставленных задач в рамках выбранного периода"
	+Символы.ПС + "<b>Анализ потраченного времени</b> - показывает количество задач, по которым уже проводилась работа, суммарно затраченное время на их реализацию, расчетную стоимость реализации в рамка выбранного периода"
	+Символы.ПС + "&#127918; <b>На контроле</b> - возможность просмотра online задач и незавершенных задач";
	
	СтрокаJSON = СоздатьInlineKeyboard();
	
	СтрокаJSON.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(СтрокаJSON, "⏰ Тайминг дня", "daytiming");
	СтрокаJSON.ЗаписатьКонецМассива();
	
	СтрокаJSON.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(СтрокаJSON, "Анализ потраченного времени", "elapsedtime");
	СтрокаJSON.ЗаписатьКонецМассива();
	
	СтрокаJSON.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(СтрокаJSON, "\uD83C\uDFAE На контроле", "grouptasks");
	СтрокаJSON.ЗаписатьКонецМассива();
	
	reply_markup = ДобавитьInlineКнопкуОтменить(СтрокаJSON);
	
	ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, СтрокаИнтернетОтвета, reply_markup, Истина);
	
КонецПроцедуры

Процедура ОтчетПотраченноеВремя(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение)
	Попытка
		СТрокаИнтернетОтвета = "";
		reply_markup = "";
		ОтправитьНачалоРаботы = Ложь;
		ОтправитьКалендарь = Ложь;
		
		Данные = Новый Структура("НачалоПериода, ОкончаниеПериода, Пользователи, ГруппаАдресации");
		
		Если Не ТекущийЗапрос = Неопределено Тогда		
			ЗаполнитьЗначенияСвойств(Данные,ТекущийЗапрос.Данные);
		КонецЕсли;
		
		Если ТекущийЗапрос = Неопределено Тогда
			ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "ОтчетПотраченноеВремя", 1, Данные);
			
			АдминистрируемыеПространства = ПраваИНастройки.ДоступныеПространстваПользователя(ПараметрыСеанса.Сотрудник, Перечисления.РолиПользователей.Администратор);
			
			ЭтоАдминистратор = НЕ АдминистрируемыеПространства.Найти(ПараметрыСеанса.ТекущееПространство) = Неопределено;
			РуководительГруппАдресации = Справочники.ГруппыАдресации.ПолучитьДоступныеГруппыАдресацииРуководителя(ПараметрыСеанса.ТекущееПространство,ПараметрыСеанса.Сотрудник);
			
			Если ЭтоАдминистратор Тогда
				
				Пользователи = ПраваИНастройки.ПолучитьПользователейПространства(ПараметрыСеанса.ТекущееПространство);
				
				ГруппыАдресации = Справочники.ГруппыАдресации.ПолучитьГруппыАдресацииПространства(ПараметрыСеанса.ТекущееПространство);
				
				ЗаписьJSON = СоздатьInlineKeyboard();
				Для Каждого Группа Из ГруппыАдресации Цикл
					ЗаписьJSON.ЗаписатьНачалоМассива();
					ДобавитьInlineКнопку(ЗаписьJSON, Строка(Группа)+"(группа)", "group:" + Строка(Группа.УникальныйИдентификатор()));
					ЗаписьJSON.ЗаписатьКонецМассива();
				КонецЦикла;
				
				Для Каждого Пользователь Из Пользователи Цикл 
					ЗаписьJSON.ЗаписатьНачалоМассива();
					ДобавитьInlineКнопку(ЗаписьJSON, Строка(Пользователь), "employee:" + Строка(Пользователь.УникальныйИдентификатор()));
					ЗаписьJSON.ЗаписатьКонецМассива();
				КонецЦикла;
				
				reply_markup = ДобавитьInlineКнопкуОтменить(ЗаписьJSON);			
			ИначеЕсли РуководительГруппАдресации.Количество() Тогда
				
				ПользователиВСписок = Новый Массив;
				ЗаписьJSON = СоздатьInlineKeyboard();
				Для Каждого Группа Из РуководительГруппАдресации Цикл
					ЗаписьJSON.ЗаписатьНачалоМассива();
					ДобавитьInlineКнопку(ЗаписьJSON, Строка(Группа)+"(группа)", "group:" + Строка(Группа.УникальныйИдентификатор()));
					ЗаписьJSON.ЗаписатьКонецМассива();
					
					ДоступныеПользователи = Справочники.ГруппыАдресации.ПолучитьУчастниковГруппыАдресации(ПараметрыСеанса.ТекущееПространство, Группа);
					Для Каждого текПользователь Из ДоступныеПользователи Цикл
						
						Если ПользователиВСписок.Найти(текПользователь) = Неопределено Тогда
							
							ПользователиВСписок.Добавить(текПользователь);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;  
				
				Для Каждого Пользователь Из ПользователиВСписок Цикл
					
					ЗаписьJSON.ЗаписатьНачалоМассива();
					ДобавитьInlineКнопку(ЗаписьJSON, Строка(Пользователь), "employee:" + Строка(Пользователь.УникальныйИдентификатор()));
					ЗаписьJSON.ЗаписатьКонецМассива();
				КонецЦикла;    
				reply_markup = ДобавитьInlineКнопкуОтменить(ЗаписьJSON);
			Иначе
				
				ТекущийЗапрос = Новый Структура("Стадия, Данные, Команда", 1, Данные, "ОтчетПотраченноеВремя");
				ОтчетПотраченноеВремя(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, "employee:" + Строка(ПараметрыСеанса.Сотрудник.УникальныйИдентификатор()));
				Возврат;
			КонецЕсли;
			
			СтрокаИнтернетОтвета  = "➡ Выберите сотрудника или группу:";
		ИначеЕсли ТекущийЗапрос.Стадия = 1 Тогда
			Если Найти(Сообщение, "group:")>0 Тогда
				
				guidГруппаАдресации = Сред(Сообщение, найти(Сообщение, ":")+1);
				Данные.ГруппаАдресации = guidГруппаАдресации;
				
			ИначеЕсли Найти(Сообщение, "employee:")>0 Тогда
				guidПользователь = Сред(Сообщение, найти(Сообщение, ":")+1);
				Данные.Пользователи = guidПользователь;
			КонецЕсли;
			
			ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "ОтчетПотраченноеВремя", 2, Данные);
			
			// Формируем выбор периодов
			ЗаписьJSON = СоздатьInlineKeyboard();
			
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(ЗаписьJSON, "С начала текущего месяца", "beginmonth");
			ЗаписьJSON.ЗаписатьКонецМассива();
			
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(ЗаписьJSON, "Прошлая неделя", "lastweek");
			ЗаписьJSON.ЗаписатьКонецМассива();
			
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(ЗаписьJSON, "Текущая неделя", "thisweek");
			ЗаписьJSON.ЗаписатьКонецМассива();
			
			ЗаписьJSON.ЗаписатьНачалоМассива();
			ДобавитьInlineКнопку(ЗаписьJSON, "Произвольный период", "arbitrary");
			ЗаписьJSON.ЗаписатьКонецМассива();
			
			reply_markup = ЗавершитьInlineKeyboard(ЗаписьJSON);
			
			СтрокаИнтернетОтвета = "Выберите период отчета";
			
		ИначеЕсли ТекущийЗапрос.Стадия = 2 Тогда
			
			Если Сообщение = "beginmonth" Тогда
				НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
				ОкончаниеПериода = КонецДня(ТекущаяДатаСеанса());
			ИначеЕсли Сообщение = "lastweek" Тогда
				НачалоПериода = НачалоНедели(НачалоНедели(ТекущаяДатаСеанса()) - 1);
				ОкончаниеПериода = НачалоНедели(ТекущаяДатаСеанса()) - 1;
			ИначеЕсли Сообщение = "thisweek" Тогда
				НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
				ОкончаниеПериода = КонецНедели(ТекущаяДатаСеанса());
			КонецЕсли;
			
			Если Сообщение = "arbitrary" Тогда
				ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "ОтчетПотраченноеВремя", 3, Данные);
				ТекущийЗапрос.стадия = 3;
			Иначе
				
				Данные.НачалоПериода = НачалоПериода;
				Данные.ОкончаниеПериода = ОкончаниеПериода;
				ТекущийЗапрос.Стадия = 4;
			КонецЕсли;
			
			ТекущийЗапрос.Данные = Данные;
			ОтчетПотраченноеВремя(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, "");
			Возврат;
		ИначеЕсли ТекущийЗапрос.Стадия = 3 Тогда
			
			Если НЕ ЗначениеЗаполнено(Сообщение) Тогда // выводим календарь для ввода даты начала
				СтрокаИнтернетОтвета = "Укажите начало периода";
				
				НачалоКалендаря = ДобавитьМесяц(НачалоМесяца(ТекущаяДатаСеанса()), -1);
				
				СообщениеКалендаря = Новый Структура("cmd ,dateStart, date", "calendar", НачалоКалендаря- Дата(1,1,1), НачалоКалендаря- Дата(1,1,1));
				ОтправитьКалендарь = Истина;
			ИначеЕсли ЗначениеЗаполнено(Данные.НачалоПериода) Тогда // Запоминаем дату окончания и идем дальше
				Данные.ОкончаниеПериода = Дата(1, 1, 1) + Сообщение;
				ТекущийЗапрос.стадия = 4;
				ТекущийЗапрос.Данные = Данные;
				ОтчетПотраченноеВремя(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, "");
				Возврат;
			Иначе // запоминаем дату Начала и выводим календарь для ввода даты окончания
				СтрокаИнтернетОтвета = "Укажите конец периода";
				Данные.началоПериода = Дата(1,1,1) + Сообщение;
				НачалоКалендаря = Данные.началоПериода - Дата(1,1,1);
				СообщениеКалендаря = Новый Структура("cmd ,dateStart, date", "calendar", НачалоКалендаря, НачалоКалендаря);
				ОтправитьКалендарь = Истина;
			КонецЕсли;
			
			ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "ОтчетПотраченноеВремя", 3, Данные);
		ИначеЕсли ТекущийЗапрос.Стадия = 4 Тогда
			
			Пользователь = Неопределено;
			Если ЗначениеЗаполнено(Данные.Пользователи) Тогда
				Пользователь = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.Пользователи));
			КонецЕсли;
			
			ГруппаАдресации = Неопределено;
			Если ЗначениеЗаполнено(Данные.ГруппаАдресации) Тогда
				ГруппаАдресации = Справочники.ГруппыАдресации.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.ГруппаАдресации));
			КонецЕсли;
			
			Если НЕ Значениезаполнено(Пользователь) Тогда
				УчастникиГруппы = Справочники.ГруппыАдресации.ПолучитьУчастниковГруппыАдресации(ПараметрыСеанса.ТекущееПространство, ГруппаАдресации);
				Пользователи = Новый СписокЗначений;
				Для Каждого Участник Из УчастникиГруппы Цикл
					Пользователи.Добавить(Участник);
				КонецЦикла;
			иначе
				Пользователи = Пользователь;
			КонецЕсли;
			
			АнализПотраченногоВремени = Отчеты["АнализПотраченногоВремени"].Создать();
			Для Каждого Элемент Из АнализПотраченногоВремени.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				Если Строка(Элемент.Параметр) = "ПериодОтчета" Тогда
					Элемент.Значение.ДатаНачала = Данные.НачалоПериода;
					Элемент.Значение.ДатаОкончания = Данные.ОкончаниеПериода;
				ИначеЕсли Строка(Элемент.Параметр) = "НаименованиеСотрудник" Тогда
					Элемент.Значение = Пользователи;
				ИначеЕсли Строка(Элемент.Параметр) = "НаименованиеОрганизация" Тогда
					Элемент.Значение = Справочники.Клиенты.ПолучитьСписокДоступныхПространствуКлиентов(ПараметрыСеанса.ТекущееПространство);
				КонецЕсли;
			КонецЦикла;
			
			ТД_ОписательнаяЧасть = Новый ТабличныйДокумент;
			
			АнализПотраченногоВремени.СкомпоноватьРезультат(ТД_ОписательнаяЧасть);
			
			ПутьКФайлу = ПолучитьИмяВременногоФайла();
			ТД_ОписательнаяЧасть.АвтоМасштаб=Истина;
			
			ТД_ОписательнаяЧасть.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.PDF);
			
			Структура = Новый Структура("Имя,Путь", "Затраченное на задачи время с " + Формат(Данные.НачалоПериода, "ДФ=dd.MM") + " по " + Формат(Данные.ОкончаниеПериода, "ДФ=dd.MM") + ".pdf", ПутьКФайлу);
			ОтправитьВTelegramDocument(ИмяБота, TelegramId, Структура.Имя, Структура.Путь, "");
			ОтправитьНачалоРаботы = истина;
		КонецЕсли;
		
		ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId);
		
		Если ОтправитьКалендарь Тогда
			ОткрытьКалендарь(ИмяБота, TelegramId, 0, СообщениеКалендаря, СтрокаИнтернетОтвета);
		Иначе
			ОтправитьВTelegramText(ИмяБота, TelegramId, 0, СтрокаИнтернетОтвета, reply_markup,Истина);
		КонецЕсли;
		
		Если ОтправитьНачалоРаботы Тогда
			
			НачалоРаботы(ИмяБота,TelegramId);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("elapsedtime", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры






  

#Область ПриемИПервичнаяОбработкаВходящихСообщений   

Процедура ПрочитатьСообщениеTelegram(ИмяБота, Сообщение) Экспорт
	
	ДобавитьВИсториюЗапросов(ИмяБота,Сообщение);
	
	Попытка
		Если Сообщение.Свойство("callback_query") Тогда
			
			ВыполнитьИнлайнКомандуБота(ИмяБота, Сообщение.callback_query);
			
		ИначеЕсли Сообщение.Свойство("message")  Тогда
			
			Если Сообщение.message.Свойство("text") 
				ИЛИ Сообщение.message.Свойство("contact") Тогда
				
				ВыполнитьКомандуБота(ИмяБота, Сообщение.message);
				
			ИначеЕсли Сообщение.message.Свойство("photo") Или
				Сообщение.message.Свойство("document") Или
				Сообщение.message.Свойство("video") Или
				Сообщение.message.Свойство("voice") Тогда
				
				ИнформацияОФайле = ПринятьФайл(ИмяБота, Сообщение.message);
				
				TelegramId = Сообщение.message.chat.id;
				
				ВыполнитьОбработкуФайла(ИмяБота, TelegramId, ИнформацияОФайле);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ПрочитатьСообщенияTelegram(ИмяБота, Обновления, Смещение)
	
	ДеревоЗн = Новый ДеревоЗначений();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Обновления);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если НЕ Результат.ok Тогда
		Возврат;
	КонецЕсли;
	
	СписокСообщений = Результат.result;
	
	Если СписокСообщений.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации("Telegram.ПринятыеСообщения", УровеньЖурналаРегистрации.Информация,,,Обновления);
		
		Для каждого Сообщение Из СписокСообщений Цикл
			
			Смещение = Сообщение.update_id;
			
			ПрочитатьСообщениеTelegram(ИмяБота, Сообщение);
		КонецЦикла;
	Иначе
		
		Смещение = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьИнлайнКомандуБота(ИмяБота, callback_query)
	
	TelegramId = callback_query.message.chat.id;
	MessageId  = callback_query.message.message_id;
	
	ТекущийЗапрос = ПолучитьТекущийЗапрос(TelegramId,ИмяБота);
	
	СотрудникЗарегистрированВTelegram(TelegramId);
	
	Если Лев(callback_query.data, 1) = "{" И
		Прав(callback_query.data, 1) = "}" Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(callback_query.data);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ДанныеJSON.Свойство("deffered") Тогда
			
			ОтложенныйЗапросId = ДанныеJSON.deffered;
		КонецЕсли;         
		
		МассивНайденныхСтрок = ТаблицаПонимаемыхКоманд(ИмяБота,TelegramId).Строки.НайтиСтроки(Новый Структура("Имя", ДанныеJSON.cmd), Истина);		
	Иначе
		
		Поз = Найти(callback_query.data, "deffered:");
		
		Если Поз > 0 Тогда // Отложенный запрос. Пример: deffered:26952456
			
			ОтложенныйЗапросId = Сред(callback_query.data, Поз + 9);
		КонецЕсли;
		
		МассивНайденныхСтрок = ТаблицаПонимаемыхКоманд(ИмяБота,TelegramId).Строки.НайтиСтроки(Новый Структура("Имя", callback_query.data), Истина);
	КонецЕсли;
	
	Если Не ОтложенныйЗапросId = Неопределено Тогда
		
		ОтложенныйЗапрос = ПолучитьОтложенныйЗапрос(ОтложенныйЗапросId);
		
		Если Не ОтложенныйЗапрос = Неопределено Тогда
			
			ТекущийЗапрос = ОтложенныйЗапрос;	
		Иначе
			
			ТекущийЗапрос = ПолучитьТекущийЗапрос(TelegramId, ИмяБота);
		КонецЕсли;
	Иначе
		
		ТекущийЗапрос = ПолучитьТекущийЗапрос(TelegramId, ИмяБота);
	КонецЕсли; 
	
	Попытка
		
		Команда = Неопределено;
		
		Если МассивНайденныхСтрок.Количество() > 0 Тогда
			
			Команда = МассивНайденныхСтрок[0].Команда;
		ИначеЕсли Не ТекущийЗапрос = Неопределено Тогда
			
			Команда = ТекущийЗапрос.Команда;
		КонецЕсли;
		
		Если Не ОбработкаПрисоединенияКДокументам(ИмяБота, TelegramId, Команда) Тогда
			
			Возврат;
		КонецЕсли;
		
		Если Не Команда = Неопределено Тогда   
			
			Если Команда = "ОтменитьЗапрос" 
				Или callback_query.data = "cancel"
				Или (ТипЗнч(ДанныеJSON) = Тип("Структура")
				И ДанныеJSON.Свойство("cmd")
				И ДанныеJSON.cmd = "cancel"
				И ДанныеJSON.Свойство("deffered")
				И ЗначениеЗаполнено(ДанныеJSON.deffered)) Тогда
				
				ОтправитьВTelegramDeleteMessage(ИмяБота, TelegramId, MessageId);
				НачалоРаботы(ИмяБота, TelegramId);
				
				Если ТипЗнч(ДанныеJSON) = Тип("Структура")
					И ДанныеJSON.Свойство("cmd")
					И ДанныеJSON.cmd = "cancel"
					И ДанныеJSON.Свойство("deffered")
					И ЗначениеЗаполнено(ДанныеJSON.deffered) Тогда
					
					УдалитьОтложенныйЗапрос(ДанныеJSON.deffered); 
				КонецЕсли;
				Возврат;
			КонецЕсли;            
			
			Если Команда = "ПрисоединениеКДокументам" Тогда
				
				ПрисоединениеКДокументам(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, callback_query.data);
				Возврат;
			КонецЕсли;
			
			Если СотрудникЗарегистрированВTelegram(TelegramId) Тогда
				
				Если Команда = "ОткрытьКалендарь" Тогда
					
					ОткрытьКалендарь(ИмяБота, TelegramId, MessageId, ДанныеJSON, callback_query.message.text);
				ИначеЕсли Команда = "ОткрытьВремя" Тогда
					
					ОткрытьВремя(ИмяБота, TelegramId, MessageId, ДанныеJSON);	
				ИначеЕсли Команда = "КомандаНазад" Тогда
					
					КомандаНазад(ИмяБота,TelegramId,MessageId);
				Иначе      
					
					Попытка
						
						Если ЗначениеЗаполнено(ДанныеJSON) Тогда
							
							Выполнить(Команда +"(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, callback_query.data, ДанныеJSON)");
						Иначе
							
							Выполнить(Команда +"(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, callback_query.data)");
						КонецЕсли;
					Исключение
						
						НачалоРаботы(ИмяБота, TelegramId);
					КонецПопытки;
				КонецЕсли; 
			Иначе
				
				Зарегистрироваться(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, callback_query.data);
			КонецЕсли;
		Иначе
			
			НачалоРаботы(ИмяБота, TelegramId, MessageId);
		КонецЕсли;
		
	Исключение
		
		Ошибка = ОписаниеОшибки();
		
		Telegram.ОтправитьИнформационноеСообщение(511985368,"Ошибка: "+ ИмяБота + Символы.ПС + "База: " + ОбщийСерверПовтИсп.ПолучитьИмяБазы() + Символы.ПС + Ошибка);      
		
		МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
		Сообщение = "";
		
		Для Каждого СообщениеПользователю Из МассивСообщенийПользователю Цикл
			
			Сообщение = Сообщение + СообщениеПользователю.Текст + Символы.ПС;
		КонецЦикла;
		
		Если Не ПустаяСтрока(Сообщение) Тогда
			
			Сообщение    = Лев(Сообщение, СтрДлина(Сообщение) - 1);
			reply_markup = СписокКоманд(ИмяБота, TelegramId);
			
			ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, Сообщение, reply_markup);
			
			ЗаписьЖурналаРегистрации("Telegram.ВыполнитьИнлайнКомандуБота", УровеньЖурналаРегистрации.Ошибка,,,"Сообщение пользователю:" + Символы.ПС + Сообщение);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьКомандуБота(ИмяБота, message)
	
	TelegramId = message.chat.id;
	
	MessageId = РегистрыСведений.TelegramПоследнееСообщение.ПолучитьMessageId(ИмяБота,TelegramId).MessageId;
	
	СотрудникЗарегистрированВTelegram(TelegramId);
	
	Попытка
		
		ТекущийЗапрос = ПолучитьТекущийЗапрос(TelegramId, ИмяБота);
		
		Если message.Свойство("text") Тогда
			Сообщение     = message.text;
		КонецЕсли;
		
		Если ТекущийЗапрос = Неопределено Тогда
			
			Команда = "";
		Иначе
			
			Команда = ТекущийЗапрос.Команда;
		КонецЕсли;
		
		// Если при присоединении отправили что то в чат
		Если Команда = "ПрисоединениеКДокументам" Тогда
			
			Команда = ""
		КонецЕсли;
		
		Если Не ОбработкаПрисоединенияКДокументам(ИмяБота,TelegramId,Команда) Тогда
			
			Возврат;
		КонецЕсли; 
		
		Если Сообщение = "/start"
			Или Сообщение = "/cancel" Тогда
			
			НачалоРаботы(ИмяБота, TelegramId);  
			Возврат;
		КонецЕсли;
		
		Если Не ТекущийЗапрос = Неопределено И Сообщение = "back" И ТекущийЗапрос.Стадия > 0 Тогда
			
			КомандаНазад(ИмяБота,ТекущийЗапрос);
		ИначеЕсли  Сообщение = "back" Тогда			
			
			НачалоРаботы(ИмяБота, TelegramId, MessageId);
		ИначеЕсли НЕ ТекущийЗапрос = Неопределено
			И ТекущийЗапрос.Команда = "Зарегистрироваться" Тогда
			Зарегистрироваться(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, message);
			Возврат;
		КонецЕсли;			
		
		Если СотрудникЗарегистрированВTelegram(TelegramId) И
			Не ТекущийЗапрос = Неопределено Тогда     
			
			Попытка
				
				Выполнить(ТекущийЗапрос.Команда + "(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение)");
			Исключение 
				НачалоРаботы(ИмяБота, TelegramId, MessageId);
			КонецПопытки;
		Иначе
			НачалоРаботы(ИмяБота, TelegramId);
		КонецЕсли;
		
	Исключение
		
		МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
		Сообщение = "";
		
		Ошибка = ОписаниеОшибки();
		
		Telegram.ОтправитьИнформационноеСообщение(511985368,"Ошибка: "+ ИмяБота + Символы.ПС + "База: " + ОбщийСерверПовтИсп.ПолучитьИмяБазы() + Символы.ПС + Ошибка);
		
		Для Каждого СообщениеПользователю Из МассивСообщенийПользователю Цикл
			
			Сообщение = Сообщение + СообщениеПользователю.Текст + Символы.ПС;
		КонецЦикла;
		
		Если Не ПустаяСтрока(Сообщение) Тогда
			
			Сообщение = Лев(Сообщение, СтрДлина(Сообщение) - 1);
			
			ОтправитьВTelegramText(ИмяБота, TelegramId, 0, Сообщение);
			
			ЗаписьЖурналаРегистрации("Telegram.ВыполнитьКомандуБота", УровеньЖурналаРегистрации.Ошибка,,,"Сообщение пользователю:" + Символы.ПС + Сообщение);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти  

#Область ИсходящаяОтправкаСообщенийФайловИУведомлений 

//ОтправитьИнформационноеСообщение
//
// Параметры:
//	Получатели - Справочник.Пользователи, Справочник.ДолжностныеСекции, Массив - Получатели сообщения
//	ТекстСообщения - Строка - Текст сообщения
//
Процедура ОтправитьИнформационноеСообщение(Знач Получатели, ТекстСообщения) Экспорт
	
	Если Не Константы.ИспользоватьTelegram.Получить() ИЛИ ТипЗнч(Получатели) = Тип("Строка") Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Получатели) = Тип("СправочникСсылка.Пользователи") Тогда
		
		Получатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Получатели.TelegramId);
	КонецЕсли;
	
	Если ТипЗнч(Получатели) = Тип("Число") Тогда
		
		Получатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Получатели);
	КонецЕсли;
	
	Для Каждого Получатель Из Получатели Цикл
		
		Если Получатель = 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ИмяБота = ПолучитьИмяБота();
		
		ПоследнееСообщение = ПолучитьПоследнееСообщение(ИмяБота, Получатель);
		
		Если ПоследнееСообщение = ТекстСообщения Тогда
			
			Возврат;
		КонецЕсли;
		
		ОтправитьВTelegramText(ИмяБота, Получатель, 0, ТекстСообщения,,Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьНапоминание() Экспорт
	
	Если Не Константы.ИспользоватьTelegram.Получить() Тогда
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TelegramОповещения.TelegramId КАК TelegramId,
	|	TelegramОповещения.ВремяОтправки КАК ВремяОтправки,
	|	TelegramОповещения.ИмяБота КАК ИмяБота,
	|	TelegramОповещения.ТекстСообщения КАК ТекстСообщения,
	|	TelegramОповещения.ИдентификаторОтложенногоЗапроса КАК ИдентификаторОтложенногоЗапроса
	|ИЗ
	|	РегистрСведений.TelegramОповещения КАК TelegramОповещения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Ид = ОтправитьВTelegramText(ВыборкаДетальныеЗаписи.ИмяБота,ВыборкаДетальныеЗаписи.TelegramId,0,ВыборкаДетальныеЗаписи.ТекстСообщения,"",Истина);
		
		Если Ид > 0 Тогда
			
			ЗаписьУдалить = РегистрыСведений.TelegramОповещения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ЗаписьУдалить,ВыборкаДетальныеЗаписи);
			ЗаписьУдалить.Удалить();		
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, знач СтрокаСообщения, reply_markup = "", parse_mode_HTML = Ложь, ИдентификаторОтложенногоЗапроса = 0, ПоследняяПопытка = Ложь) Экспорт
	
	Если parse_mode_HTML Тогда
		
		СтрокаСообщения = ЗаменитьСкобкиНаСлова(СтрокаСообщения);
	КонецЕсли;
	
	reply_markup = СтрЗаменить(reply_markup,"\\","\");
	
	Если СтрДлина(СтрокаСообщения) > 3600 Тогда
		
		КоличествоСообщений = Цел(СтрДлина(СтрокаСообщения)/3600);
		
		текПозиция = 0;
		
		Для Сч = 1 По КоличествоСообщений + 1 Цикл
			
			текСтрока = Сред(СтрокаСообщения,текПозиция,3600);
			
			Если СтрДлина(текСтрока) > 0 Тогда
				
				ПереносСтроки = СтрНайти(текСтрока,Символы.ПС,НаправлениеПоиска.СКонца);
				
				Если ПереносСтроки > 0 Тогда
					
					текПозиция = ПереносСтроки + текПозиция;
					текСтрока = Лев(текСтрока,ПереносСтроки);
				Иначе
					
					текПозиция = 3600;
				КонецЕсли;
				
				MessageIdPart = ОтправитьВTelegramText(ИмяБота, TelegramId, 0, текСтрока, reply_markup, parse_mode_HTML);
			КонецЕсли;                                                                                                                                                                				
		КонецЦикла;
		Возврат MessageIdPart;
	КонецЕсли;
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());
	
	//Определяем массив для процедуры ОбъединитьФайлы 
	МассивФайловДляОбъединения = Новый Массив; 
	
	//Формируем начальный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8); 
	
	ТекстДляОтправки = "";
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	Если MessageId > 0 Тогда
		
		// Идентификатор сообщения
		ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
		ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""message_id""" + Символы.ПС + Символы.ПС;    
		ТекстДляОтправки = ТекстДляОтправки + Формат(MessageId, "ЧГ=") + Символы.ПС;
	КонецЕсли;
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	
	Если parse_mode_HTML Тогда
		
		// parse_mode
		ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
		ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""parse_mode""" + Символы.ПС + Символы.ПС;    
		ТекстДляОтправки = ТекстДляОтправки + "HTML" + Символы.ПС;
	КонецЕсли;
	
	// Текст
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""text""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + СтрокаСообщения + Символы.ПС;
	
	// Кнопки для ответа
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""reply_markup""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + reply_markup + Символы.ПС;
	
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	
	ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramText", УровеньЖурналаРегистрации.Информация,,,ТекстДляОтправки);
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлОтправкиНачало.Закрыть();
	
	Если MessageId > 0 Тогда
		Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/editMessageText";
	Иначе
		Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/sendMessage";
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	Заголовки = Новый Соответствие;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive"); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary); 
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправкиНачало);    
	
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка 
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
		РегистрыСведений.TelegramПоследнееСообщение.ДобавитьЗапись(ОтветСтрокой, Не ПустаяСтрока(reply_markup),ИмяБота);
		ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramText", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + "Ответ" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
		
		Если Не Лев(ОтветСтрокой, 1) = "{" Или
			Не Прав(ОтветСтрокой, 1) = "}" Тогда
			
			Если Не ПустаяСтрока(ИдентификаторОтложенногоЗапроса) И ПоследняяПопытка Тогда
				
				УдалитьОтложенныйЗапрос(ИдентификаторОтложенногоЗапроса);
			КонецЕсли;
			
			Возврат 0;
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ДанныеJSON.Свойство("ok") И
			ДанныеJSON.ok = Истина И
			ДанныеJSON.Свойство("result") И
			ТипЗнч(ДанныеJSON.result) = Тип("Структура") Тогда
			
			Возврат ДанныеJSON.result.message_id;
		Иначе
			
			Если Не ПустаяСтрока(ИдентификаторОтложенногоЗапроса) И ПоследняяПопытка Тогда
				
				УдалитьОтложенныйЗапрос(ИдентификаторОтложенногоЗапроса);
			КонецЕсли;
			
			Возврат 0;
		КонецЕсли;   
		
	Исключение
		
		Если Не ПустаяСтрока(ИдентификаторОтложенногоЗапроса) И ПоследняяПопытка Тогда
			
			УдалитьОтложенныйЗапрос(ИдентификаторОтложенногоЗапроса);
		КонецЕсли;
		
		ОбщийСервер.Пауза(1);
		
		Попытка
			
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
			РегистрыСведений.TelegramПоследнееСообщение.ДобавитьЗапись(ОтветСтрокой, Не ПустаяСтрока(reply_markup),ИмяБота);
			ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramText", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + "Ответ" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
			
			Если Не Лев(ОтветСтрокой, 1) = "{" Или
				Не Прав(ОтветСтрокой, 1) = "}" Тогда
				
				Если ИдентификаторОтложенногоЗапроса > 0 И ПоследняяПопытка Тогда
					
					УдалитьОтложенныйЗапрос(ИдентификаторОтложенногоЗапроса);
				КонецЕсли;
				
				Возврат 0;
			КонецЕсли;
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ДанныеJSON.Свойство("ok") И
				ДанныеJSON.ok = Истина И
				ДанныеJSON.Свойство("result") И
				ТипЗнч(ДанныеJSON.result) = Тип("Структура") Тогда
				
				Возврат ДанныеJSON.result.message_id;
			Иначе
				
				Если Не ПустаяСтрока(ИдентификаторОтложенногоЗапроса) И ПоследняяПопытка Тогда
					
					УдалитьОтложенныйЗапрос(ИдентификаторОтложенногоЗапроса);
				КонецЕсли;
				
				Возврат 0;
			КонецЕсли;
		Исключение
			
			СообщениеОбОшибке = ОписаниеОшибки();
			Telegram.ОтправитьИнформационноеСообщение(1022160150,"Подробности ошибки: "+ ИмяБота + Символы.ПС + СообщениеОбОшибке);
			
			Возврат 0;
		КонецПопытки;
	КонецПопытки;
	
	Возврат 0;
	
КонецФункции

Процедура ОтправитьВTelegramAnswerCallbackQuery(ИмяБота, TelegramId)
	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());
	
	//Определяем массив для процедуры ОбъединитьФайлы 
	МассивФайловДляОбъединения = Новый Массив; 
	
	//Формируем начальный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8); 
	
	ТекстДляОтправки = "";
	
	// callback_query_id
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""callback_query_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	// url
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""url""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "INTERNAL_URL" + Символы.ПС;
	
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	
	ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramGame", УровеньЖурналаРегистрации.Информация,,,ТекстДляОтправки);
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлОтправкиНачало.Закрыть();
	
	Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/answerCallbackQuery";
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	Заголовки = Новый Соответствие;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive"); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary); 
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправкиНачало);    
	
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка 
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramAnswerCallbackQuery", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + "Ответ" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId) Экспорт
	
	Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/deleteMessage?chat_id=" + Формат(TelegramId, "ЧГ=") + "&message_id=" + Формат(MessageId, "ЧГ=");
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPЗапрос.АдресРесурса = Ресурс;
	
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка 
		
		Ответ = Соединение.Получить(HTTPЗапрос);
	Исключение
		
		ОбщийСервер.Пауза(1);
		
		Попытка
			
			Ответ = Соединение.Получить(HTTPЗапрос);		
		Исключение
			СообщениеОбОшибке = ОписаниеОшибки();
			Telegram.ОтправитьИнформационноеСообщение(511985368,"Подробности ошибки: "+ ИмяБота + Символы.ПС + СообщениеОбОшибке);
		КонецПопытки;	
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьВTelegramDocument(ИмяБота, TelegramId, ИмяФайла, ИмяФайлаДляЗагрузки, СтрокаСообщения, reply_markup = "")
	
	ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramDocument", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + СтрокаСообщения);
	
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()),"-","");
	
	//Определяем массив для процедуры ОбъединитьФайлы 
	МассивФайловДляОбъединения = Новый Массив; 
	
	//Формируем начальный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8); 
	
	//Формируем конечный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
	ФайлаОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8);
	
	ТекстДляОтправки = "";
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	// Подпись
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""caption""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + СтрокаСообщения + Символы.ПС;
	
	// Кнопки для ответа
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""reply_markup""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + reply_markup + Символы.ПС;
	
	// Фото
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""document""; filename=" + ИмяФайла + "" + Символы.ПС;    
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлОтправкиНачало.Закрыть();
	
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиНачало); 
	МассивФайловДляОбъединения.Добавить(ИмяФайлаДляЗагрузки); 
	
	ТекстДляОтправки = "" + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	ФайлаОтправкиКонец.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлаОтправкиКонец.Закрыть(); 
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиКонец); 
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяФайлаОтправки);
	
	Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/sendDocument";
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	Заголовки = Новый Соответствие;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive"); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary); 
	ФайлЗ = Новый Файл(ИмяФайлаОтправки);
	HTTPЗапрос.Заголовки.Вставить("Content-Length",XMLСтрока(ФайлЗ.Размер()));
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);    
	
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка 
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramDocument", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + "Ответ" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());
	Исключение
		
		ОбщийСервер.Пауза(1);
		
		Попытка
			
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			ЗаписьЖурналаРегистрации("Telegram.ОтправитьВTelegramDocument", УровеньЖурналаРегистрации.Информация,,,Строка(TelegramId) + Символы.ПС + "Ответ" + Символы.ПС + Ответ.ПолучитьТелоКакСтроку());			
		Исключение
			СообщениеОбОшибке = ОписаниеОшибки();
			Telegram.ОтправитьИнформационноеСообщение(511985368,"Подробности ошибки: "+ ИмяБота + Символы.ПС + СообщениеОбОшибке);
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьВTelegramPhoto(ИмяБота, TelegramId, ИмяФайла, ИмяФайлаДляЗагрузки, СтрокаСообщения, reply_markup = "")
	
	Boundary = СтрЗаменить(Строка(Новый УникальныйИдентификатор()),"-","");
	
	//Определяем массив для процедуры ОбъединитьФайлы 
	МассивФайловДляОбъединения = Новый Массив; 
	
	//Формируем начальный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиНачало = ПолучитьИмяВременногоФайла("txt"); 
	ФайлОтправкиНачало = Новый ЗаписьТекста(ИмяФайлаОтправкиНачало, КодировкаТекста.UTF8); 
	
	//Формируем конечный фрагмент файла POST-запроса 
	ИмяФайлаОтправкиКонец = ПолучитьИмяВременногоФайла("txt"); 
	ФайлаОтправкиКонец = Новый ЗаписьТекста(ИмяФайлаОтправкиКонец, КодировкаТекста.UTF8);
	
	ТекстДляОтправки = "";
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	// Чат
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""chat_id""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + Формат(TelegramId, "ЧГ=") + Символы.ПС;
	
	// Подпись
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""caption""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + СтрокаСообщения + Символы.ПС;
	
	// Кнопки для ответа
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""reply_markup""" + Символы.ПС + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + reply_markup + Символы.ПС;
	
	// Фото
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Disposition: form-data; name=""photo""; filename=" + ИмяФайла + "" + Символы.ПС;    
	ТекстДляОтправки = ТекстДляОтправки + "Content-Type: image/jpeg" + Символы.ПС;
	
	ФайлОтправкиНачало.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлОтправкиНачало.Закрыть();
	
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиНачало); 
	МассивФайловДляОбъединения.Добавить(ИмяФайлаДляЗагрузки); 
	
	ТекстДляОтправки = "" + Символы.ПС;
	ТекстДляОтправки = ТекстДляОтправки + "--"+Boundary+"--";
	ФайлаОтправкиКонец.ЗаписатьСтроку(ТекстДляОтправки);
	ФайлаОтправкиКонец.Закрыть(); 
	МассивФайловДляОбъединения.Добавить(ИмяФайлаОтправкиКонец); 
	
	ИмяФайлаОтправки = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяФайлаОтправки);
	
	Ресурс = "/bot"+ДанныеБота(ИмяБота).Токен+"/sendPhoto";
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	Заголовки = Новый Соответствие;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive"); 
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary); 
	ФайлЗ = Новый Файл(ИмяФайлаОтправки);
	HTTPЗапрос.Заголовки.Вставить("Content-Length",XMLСтрока(ФайлЗ.Размер()));
	
	HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);    
	
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Попытка
		
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
		
		Если Не Лев(ОтветСтрокой, 1) = "{" Или
			Не Прав(ОтветСтрокой, 1) = "}" Тогда
			
			Возврат;
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Если ДанныеJSON.Свойство("ok") И
			ДанныеJSON.ok = Истина И
			ДанныеJSON.Свойство("result") И
			ТипЗнч(ДанныеJSON.result) = Тип("Структура") Тогда
			
			Возврат;
		КонецЕсли;    			
	Исключение
		
		ОбщийСервер.Пауза(1);
		
		Попытка
			
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			
			ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку();
			
			Если Не Лев(ОтветСтрокой, 1) = "{" Или
				Не Прав(ОтветСтрокой, 1) = "}" Тогда
				
				Возврат;
			КонецЕсли;
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ДанныеJSON.Свойство("ok") И
				ДанныеJSON.ok = Истина И
				ДанныеJSON.Свойство("result") И
				ТипЗнч(ДанныеJSON.result) = Тип("Структура") Тогда
				
				Возврат;
			КонецЕсли; 
		Исключение
			СообщениеОбОшибке = ОписаниеОшибки();
			Telegram.ОтправитьИнформационноеСообщение(511985368,"Подробности ошибки: "+ ИмяБота + Символы.ПС + СообщениеОбОшибке);
		КонецПопытки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтправитьСообщениеСФайлом(ИмяБота, TelegramId, MessageId,СтрокаСообщения,Файл)
	
	Если ЗначениеЗаполнено(Файл) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ИмяФайла КАК ИмяФайла,
		|	Файлы.РасширениеФайла КАК РасширениеФайла
		|ИЗ
		|	РегистрСведений.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.ID = &IDФайла";
		
		Запрос.УстановитьПараметр("IDФайла", Файл);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеФайла = ФайлыСервер.Прочитать(Файл);
		
		Если Не Выборка.Следующий() Или ДанныеФайла = Неопределено Тогда
			
			ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, СтрокаСообщения, "", Истина);
		Иначе
			ИмяФайлаДляЗагрузки = ПолучитьИмяВременногоФайла();
			ДанныеФайла.Данные.Записать(ИмяФайлаДляЗагрузки);
			
			Если ОбщийСервер.ЭтоКартинка(Выборка.ИмяФайла) Тогда
				
				ОтправитьВTelegramPhoto(ИмяБота, TelegramId, Выборка.ИмяФайла + "." + Выборка.РасширениеФайла, ИмяФайлаДляЗагрузки, СтрокаСообщения, "");
			Иначе
				ОтправитьВTelegramDocument(ИмяБота, TelegramId, Выборка.ИмяФайла + "." + Выборка.РасширениеФайла, ИмяФайлаДляЗагрузки, СтрокаСообщения, "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьНапоминаниеВTelegram()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Задача.Ссылка КАК Ссылка,
	|	Задача.Исполнитель.TelegramId КАК TelegramId
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	НЕ Задача.ДатаНапоминания = ДАТАВРЕМЯ(1, 1, 1)
	|	И Задача.ДатаНапоминания <= &ВыбДата
	|	И НЕ Задача.Исполнитель.TelegramId = 0";
	
	Запрос.УстановитьПараметр("ВыбДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ТекстСообщения = "Задача № " + СокрЛП(Выборка.Ссылка);
			
			ОтправитьВTelegramText("Название", Выборка.TelegramId, 0, ТекстСообщения);
			
			ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗадачаОбъект.ДатаНапоминания = Дата(1,1,1);
			ЗадачаОбъект.Записать();
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Telegram.ОтправитьНапоминаниеВTelegram", УровеньЖурналаРегистрации.Информация,,,ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьСообщенияВTelegram(ИмяБота)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.TelegramId,
	|	Сообщения.Сотрудник.Наименование КАК Сотрудник,
	|	Сообщения.Сообщение,
	|	Сообщения.IDФайла,
	|	ДиалогиУчастники.Сотрудник КАК УчастникДиалога,
	|	ДиалогиУчастники.ПоследняяОтправкаВTelegram КАК ПоследняяОтправкаВTelegram,
	|	Сообщения.ДатаВМиллисекундах КАК ДатаВМиллисекундах
	|ИЗ
	|	Справочник.Диалоги.Участники КАК ДиалогиУчастники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Сотрудники
	|		ПО ДиалогиУчастники.Сотрудник = Сотрудники.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сообщения КАК Сообщения
	|		ПО (Сообщения.Диалог = &Диалог)
	|			И ДиалогиУчастники.ПоследняяОтправкаВTelegram < Сообщения.ДатаВМиллисекундах
	|			И (ДиалогиУчастники.Сотрудник <> Сообщения.Сотрудник
	|				ИЛИ ДиалогиУчастники.Сотрудник = Сообщения.Сотрудник
	|					И НЕ Сообщения.Telegram)
	|ГДЕ
	|	ДиалогиУчастники.Ссылка = &Диалог
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Архивный
	|	И Сотрудники.TelegramId > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВМиллисекундах
	|ИТОГИ
	|	МАКСИМУМ(ПоследняяОтправкаВTelegram)
	|ПО
	|	УчастникДиалога";
	
	Запрос.УстановитьПараметр("Диалог", Справочники.Диалоги.Основной);
	
	ВыборкаУчастниковДиалога = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Массив = Новый Массив;
	
	Пока ВыборкаУчастниковДиалога.Следующий() Цикл
		
		Массив.Добавить(Новый Структура("Сотрудник,ПоследняяОтправкаВTelegram", ВыборкаУчастниковДиалога.УчастникДиалога, ТекущаяУниверсальнаяДатаВМиллисекундах()));
		
		Если ВыборкаУчастниковДиалога.ПоследняяОтправкаВTelegram = 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ВыборкаСообщений = ВыборкаУчастниковДиалога.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСообщений.Следующий() Цикл
			
			СтрокаСообщения = СокрЛП(ВыборкаСообщений.Сотрудник) + Символы.ПС + СокрЛП(ВыборкаСообщений.Сообщение);
			
			ОтправитьВTelegramText(ИмяБота, ВыборкаСообщений.TelegramId, 0, СтрокаСообщения);
		КонецЦикла;
	КонецЦикла;
	
	Если Массив.Количество() > 0 Тогда
		
		ТекДиалог = Справочники.Диалоги.Основной.ПолучитьОбъект();
		
		Для Каждого СтрокаМассива Из Массив Цикл
			
			ТекСтрока = ТекДиалог.Участники.Найти(СтрокаМассива.Сотрудник, "Сотрудник");
			Если ТекСтрока = Неопределено Тогда
				
				Продолжить;
			КонецЕсли;
			
			ТекСтрока.ПоследняяОтправкаВTelegram = СтрокаМассива.ПоследняяОтправкаВTelegram;
		КонецЦикла;
		
		ТекДиалог.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьОповещениеВTelegram(ИмяБота, ТекстОповещения, Сотрудник, ГруппаАдресации = Неопределено, Важное = Ложь, Организация = Неопределено, ПредопределеннаяДатаОтправки = Неопределено) Экспорт
	
	Если ПредопределеннаяДатаОтправки = Неопределено Тогда
		
		ПредопределеннаяДатаОтправки = ТекущаяДата();
	КонецЕсли;
	
	Сотрудники = Новый Массив;
	
	Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Пользователи") Тогда
		
		Сотрудники.Добавить(Сотрудник);
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("Массив") Тогда
		
		Для Каждого цСотрудник Из Сотрудник Цикл
			
			Сотрудники.Добавить(цСотрудник);
		КонецЦикла;
	КонецЕсли;
	
	Если ГруппаАдресации <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		
		Если Организация <> Неопределено Тогда
			
			СтрОрганизация = "И Адресация.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация",Организация);
		Иначе
			
			СтрОрганизация = "";
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Адресация.Пользователь КАК Сотрудник
		|ИЗ
		|	РегистрСведений.НастройкиГруппАдресации КАК Адресация
		|ГДЕ
		|	Адресация.ГруппаАдресации = &Группа
		|	И НЕ Адресация.Пользователь.ПометкаУдаления
		|			И НЕ Адресация.Пользователь.Архивный";
		
		Запрос.УстановитьПараметр("Группа", ГруппаАдресации);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сотрудники.Добавить(Выборка.Сотрудник);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СотрудникСтрока Из Сотрудники Цикл
		
		TelegramId = СотрудникСтрока.TelegramId; 
		
		Если TelegramId > 0 Тогда
			
			ДобавлениеОповещения = РегистрыСведений.TelegramОповещения.СоздатьМенеджерЗаписи();
			ДобавлениеОповещения.TelegramId = TelegramId;
			ДобавлениеОповещения.ВремяОтправки = ТекущаяДата();
			ДобавлениеОповещения.ИмяБота = ИмяБота;
			ДобавлениеОповещения.ТекстСообщения = ТекстОповещения;
			
			ДобавлениеОповещения.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти      

#Область МаршрутизацияКомандИГлавноеМеню    

Процедура НачалоРаботы(ИмяБота, TelegramId, MessageId = 0, Сообщение = "Выберите действие:") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	TelegramНачальнаяСтраница.TelegramId КАК TelegramId,
	|	TelegramНачальнаяСтраница.ИмяБота КАК ИмяБота,
	|	TelegramНачальнаяСтраница.MessageId КАК MessageId
	|ИЗ
	|	РегистрСведений.TelegramНачальнаяСтраница КАК TelegramНачальнаяСтраница
	|ГДЕ
	|	TelegramНачальнаяСтраница.TelegramId = &TelegramId
	|	И TelegramНачальнаяСтраница.ИмяБота = &ИмяБота";
	Запрос.УстановитьПараметр("TelegramId",TelegramId);
	Запрос.УстановитьПараметр("ИмяБота",ИмяБота);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И Выборка.MessageId > 0 Тогда
		
		ОтправитьВTelegramDeleteMessage(ИмяБота, TelegramId, Выборка.MessageId);
	КонецЕсли;
	
	ТекущееПространство = ПараметрыСеанса.ТекущееПространство;
	
	УдалитьТекущийЗапрос(ИмяБота, TelegramId);
	
	reply_markup = СписокКоманд(ИмяБота, TelegramId, ТекущееПространство);
	
	Если СтрНайти(Сообщение, "Выберите действие:",,1,1) > 0 Тогда
		Если НЕ ТекущееПространство.Пустая() Тогда
			Сообщение = "Текущее пространство: " + Строка(ТекущееПространство) +"."+ Символы.ПС + Сообщение;
		Иначе
			Сообщение = "У вас нет текущих пространств."+ Символы.ПС + Сообщение;
		КонецЕсли;
	КонецЕсли;
	
	ОтветMessageId = ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, Сообщение, reply_markup, Истина);
	
	Если ОтветMessageId > 0 Тогда
		
		МенеджерЗаписи = РегистрыСведений.TelegramНачальнаяСтраница.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИмяБота    = ИмяБота;
		МенеджерЗаписи.TelegramId = TelegramId;
		МенеджерЗаписи.MessageId  = ОтветMessageId;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция СписокКоманд(ИмяБота, TelegramId, ТекущееПространство = Неопределено)
	
	СотрудникЗарегистрированВTelegram = СотрудникЗарегистрированВTelegram(TelegramId);
	МассивПонимаемыхКоманд = ТаблицаПонимаемыхКоманд(ИмяБота, TelegramId).Строки.НайтиСтроки(Новый Структура("АвтоКоманда", Ложь));
	
	Если ТекущееПространство = Неопределено Тогда
		ТекущееПространство = ПараметрыСеанса.ТекущееПространство;
	КонецЕсли;
	
	СтрокаКнопок = "";
	Для Каждого Стр Из МассивПонимаемыхКоманд Цикл
		
		Если Стр.Команда = "Зарегистрироваться" И СотрудникЗарегистрированВTelegram Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Стр.Команда = "Зарегистрироваться" И НЕ СотрудникЗарегистрированВTelegram Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.Команда = "РаботаСПространствамиПриРегистрации" И НЕ ТекущееПространство.Пустая() И СотрудникЗарегистрированВTelegram Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Стр.Команда = "РаботаСПространствамиПриРегистрации" И ТекущееПространство.Пустая() И СотрудникЗарегистрированВTelegram Тогда
			Продолжить;
		КонецЕсли;
		
		Если Стр.Команда = "ОтчетПоСпринту" И НЕ СотрудникОтветствененЗаСпринты(TelegramId) И НЕ СотрудникУчаствуетВСпринтах(TelegramId) Тогда
			Продолжить;
		КонецЕсли;     
		
		Кнопка = "[{""text"": """ + Стр.Описание;
		Если Стр.Ссылка = "" Тогда
			Кнопка = Кнопка + """, ""callback_data"": """ + Стр.Имя + """}]";
		Иначе
			Кнопка = Кнопка + """, ""url"": """ + Стр.Ссылка + """}]";
		КонецЕсли;
		
		СтрокаКнопок = СтрокаКнопок + Кнопка + ",";
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СтрокаКнопок) Тогда
		
		Возврат "{""inline_keyboard"": [" + Лев(СтрокаКнопок, СтрДлина(СтрокаКнопок) - 1) + "]}";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаПонимаемыхКоманд(ИмяБота, TelegramId)
	
	ДеревоЗначений = Новый ДеревоЗначений;
	ДеревоЗначений.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("Команда", Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("АвтоКоманда", Новый ОписаниеТипов("Булево"));
	ДеревоЗначений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("Строка"));
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "signup";
	НоваяКоманда.Команда  = "Зарегистрироваться";
	НоваяКоманда.Описание = "✏ Зарегистрироваться";
	НоваяКоманда.Автокоманда = Ложь;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "starttask";
	НоваяКоманда.Команда  = "СтартЗадачи";
	НоваяКоманда.Описание = "Старт задачи";
	НоваяКоманда.Автокоманда = Истина; 
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "starttaskN";
	НоваяКоманда.Команда  = "СтартЗадачиБезПодтверждения";
	НоваяКоманда.Описание = "Старт задачи";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "stoptask";
	НоваяКоманда.Команда  = "СтопЗадачи";
	НоваяКоманда.Описание = "Стоп задачи";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "applytask";
	НоваяКоманда.Команда  = "ЗавершениеЗадачи";
	НоваяКоманда.Описание = "\u2705 Завершение задачи";
	НоваяКоманда.Автокоманда = Истина; 
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "applytaskSupport";
	НоваяКоманда.Команда  = "ЗавершениеЗадачиТП";
	НоваяКоманда.Описание = "\u2705 Завершение задач";
	НоваяКоманда.Автокоманда = Истина;    
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "oncontrol";
	НоваяКоманда.Команда  = "ЗадачиНаКонтроле";
	НоваяКоманда.Описание = "\ud83d\udd10 На контроле";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "resendtask";
	НоваяКоманда.Команда  = "ПереадресацияЗадачи";
	НоваяКоманда.Описание = "\ud83d\udcec Переадресация задач";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "nareas";
	НоваяКоманда.Команда  = "РаботаСПространствами";
	НоваяКоманда.Описание = "Работа с пространствами";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "nareas_registration";
	НоваяКоманда.Команда  = "РаботаСПространствамиПриРегистрации";
	НоваяКоманда.Описание = "Работа с пространствами";
	НоваяКоманда.Автокоманда = Ложь;
	
	//Работа с пространствами
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "selectarea";
	НоваяКоманда.Команда  = "РаботаСПространствамиИзменитьПространство";
	НоваяКоманда.Описание = "\ud83d\udd04 Выбрать текущее пространство";
	НоваяКоманда.Автокоманда = Ложь;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "jointhearea";
	НоваяКоманда.Команда  = "РаботаСПространствамиПрисоединитсяКПространству";
	НоваяКоманда.Описание = "Присоединится к пространству";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "adduserinarea";
	НоваяКоманда.Команда  = "РаботаСПространствамиДобавитьПользователя";
	НоваяКоманда.Описание = "Добавить пользователя в пространство";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "edituserinarea";
	НоваяКоманда.Команда  = "РаботаСПространствамиУдалитьПользователей";
	НоваяКоманда.Описание = "Удалить пользователей из пространства";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "createarea";
	НоваяКоманда.Команда  = "РаботаСПространствамиСоздатьНовое";
	НоваяКоманда.Описание = "Создать пространство";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "clients";
	НоваяКоманда.Команда  = "РаботаСПространствамиПлательщики";
	НоваяКоманда.Описание = "Плательщики";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "addclients";
	НоваяКоманда.Команда  = "ПлательщикиДобавить";
	НоваяКоманда.Описание = "Добавить плательщика";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "delclients";
	НоваяКоманда.Команда  = "ПлательщикиУдалить";
	НоваяКоманда.Описание = "УдалитьПлательщика";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "listclients";
	НоваяКоманда.Команда  = "ПлательщикВывестиСписок";
	НоваяКоманда.Описание = "Список доступных плательщиков";
	НоваяКоманда.Автокоманда = Истина;       
	
	АдминистрируемыеПространства = ПраваИНастройки.ДоступныеПространстваПользователя(ПараметрыСеанса.Сотрудник, Перечисления.РолиПользователей.Администратор);
	
	ЭтоАдминистратор = НЕ АдминистрируемыеПространства.Найти(ПараметрыСеанса.ТекущееПространство) = Неопределено;
	
	Если ЭтоАдминистратор Тогда
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя      = "addressinggroups";
		НоваяКоманда.Команда  = "РаботаСГруппамиАдресации";
		НоваяКоманда.Описание = "Группы адресации";
		НоваяКоманда.Автокоманда = истина;
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя      = "createaddresgroup";
		НоваяКоманда.Команда  = "РаботаСГруппамиАдресацииСоздать";
		НоваяКоманда.Описание = "Создать группу адресации";
		НоваяКоманда.Автокоманда = Истина; 
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя      = "editaddresgroup";
		НоваяКоманда.Команда  = "РаботаСГруппамиАдресацииИзменить";
		НоваяКоманда.Описание = "Изменить состав группы";
		НоваяКоманда.Автокоманда = Истина;
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя      = "deladdresgroup";
		НоваяКоманда.Команда  = "РаботаСГруппамиАдресацииУдалить";
		НоваяКоманда.Описание = "Удалить группу адресации";
		НоваяКоманда.Автокоманда = Истина;
	КонецЕсли;
	//Создать задачу
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя      = "createtask";
	НоваяКоманда.Команда  = "СоздатьЗадачу";
	НоваяКоманда.Описание = "⭐ Создать задачу";
	НоваяКоманда.Автокоманда = Ложь;
	
	//Работа с задачами
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "tasks";
	НоваяКоманда.Команда     = "РаботаСЗадачами";
	НоваяКоманда.Описание    = "✅ Работа с задачами";
	НоваяКоманда.Автокоманда = Ложь;       
	
	//Общие задачи
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "sharetasks";
	НоваяКоманда.Команда     = "ОбщиеЗадачи";
	НоваяКоманда.Описание    = "♨ Общие задачи (" + ПолучитьКоличествоОбщихЗадач(TelegramId) + ")";
	НоваяКоманда.Автокоманда = Ложь;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "setmygrouptask";
	НоваяКоманда.Команда     = "ОбщаяЗадача";
	НоваяКоманда.Описание    = "Общая задача";
	НоваяКоманда.Автокоманда = Истина;
	
	//Спринт
	Если Справочники.Пользователи.РольДоступнаДляСотрудника(ПараметрыСеанса.Сотрудник,"УчастникСпринта") Тогда
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя         = "sprint";
		НоваяКоманда.Команда     = "Спринт";
		НоваяКоманда.Описание    = "\ud83c\udfc3 Спринт";
		НоваяКоманда.Автокоманда = Ложь;
	КонецЕсли;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "sprintreport";
	НоваяКоманда.Команда     = "ОтчетПоСпринту";
	НоваяКоманда.Описание    = "\ud83d\udcca Отчет по спринту";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "sprintFree";
	НоваяКоманда.Команда     = "СвободныеСпринтовыеЗадачи";
	НоваяКоманда.Описание    = "\ud83c\udd93 Свободные спринтовые задачи";
	НоваяКоманда.Автокоманда = Истина;	
	
	//Какая то хуйня
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "today";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "overdue";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "completion";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "urgent";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "yourdecision";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "analytics";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "backlog";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	//
	//НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	//НоваяКоманда.Имя         = "postpone";
	//НоваяКоманда.Команда     = "РаботаСЗадачами";
	//НоваяКоманда.Описание    = "Работа с задачами";
	//НоваяКоманда.Автокоманда = Истина;
	
	
	//Разное
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "calendar";
	НоваяКоманда.Команда     = "ОткрытьКалендарь";
	НоваяКоманда.Описание    = "Открыть календарь";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "timing";
	НоваяКоманда.Команда     = "ОткрытьВремя";
	НоваяКоманда.Описание    = "Открыть календарь";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "back";
	НоваяКоманда.Команда     = "КомандаНазад";
	НоваяКоманда.Описание    = "\ud83d\udd19 Назад";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "cancelquery";
	НоваяКоманда.Команда     = "ОтменитьЗапрос";
	НоваяКоманда.Описание    = "↩ Главное меню";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "startdeffered";
	НоваяКоманда.Команда     = "ОтложеннаяЗадача";
	НоваяКоманда.Описание    = "Отложенная задача";
	НоваяКоманда.Автокоманда = Истина;
	
	//Отчетность
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "report";
	НоваяКоманда.Команда     = "ОтчетностьМеню";
	НоваяКоманда.Описание    = "\ud83d\udcca Отчетность";
	НоваяКоманда.Автокоманда = Ложь;
	
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "grouptasks";
	НоваяКоманда.Команда     = "НаКонтроле";
	НоваяКоманда.Описание    = "\uD83C\uDFAE На контроле";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "ktoday";
	НоваяКоманда.Команда     = "НаКонтроле";
	НоваяКоманда.Описание    = "На контроле";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "koverdue";
	НоваяКоманда.Команда     = "НаКонтроле";
	НоваяКоманда.Описание    = "На контроле";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "konline";
	НоваяКоманда.Команда     = "НаКонтроле";
	НоваяКоманда.Описание    = "На контроле";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "daytiming";
	НоваяКоманда.Команда     = "ОтчетЗаСегодня";
	НоваяКоманда.Описание    = "⏰ Тайминг дня";
	НоваяКоманда.Автокоманда = истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "elapsedtime";
	НоваяКоманда.Команда     = "ОтчетПотраченноеВремя";
	НоваяКоманда.Описание    = "Потраченное время";
	НоваяКоманда.Автокоманда = истина;
	
	Если ПараметрыСеанса.ТекущееПространство = Справочники.РабочиеПространства.TheMezEx Тогда
		
		НоваяКоманда = ДеревоЗначений.Строки.Добавить();
		НоваяКоманда.Имя      = "create_task_technical";
		НоваяКоманда.Команда  = "ОбратитьсяВТехПоддержку";
		НоваяКоманда.Описание = "\uD83D\uDC77 Обратиться в тех. поддержку";
		НоваяКоманда.Автокоманда = Ложь;
	КонецЕсли;
	
	//Настройки	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "settings_menu";
	НоваяКоманда.Команда     = "НастройкиМеню";
	НоваяКоманда.Описание    = "⚙️Настройки";
	НоваяКоманда.Автокоманда = Ложь;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "settings";
	НоваяКоманда.Команда     = "Настройки";
	НоваяКоманда.Описание    = "⚙️Настройки";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "settingsAlert";
	НоваяКоманда.Команда     = "НастройкаЕжедневногоУведомления";
	НоваяКоманда.Описание    = "Настройка ежедневного уведомления";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "setemployeerate";
	НоваяКоманда.Команда     = "УстановкаНормочасаСотрудника";
	НоваяКоманда.Описание    = "Установить значение нормочаса";
	НоваяКоманда.Автокоманда = Истина;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя = "wiki";
	НоваяКоманда.Команда = "Ссылка";
	НоваяКоманда.Описание = "\ud83d\udcda База знаний";
	НоваяКоманда.Ссылка = "INTERNAL_URL";
	НоваяКоманда.Автокоманда = Ложь;
	
	НоваяКоманда = ДеревоЗначений.Строки.Добавить();
	НоваяКоманда.Имя         = "help";
	НоваяКоманда.Команда     = "Помощь";
	НоваяКоманда.Описание    = "ℹ️ Помощь";
	НоваяКоманда.Автокоманда = Ложь;
	
	Возврат ДеревоЗначений;
	
КонецФункции

Процедура КомандаНазад(ИмяБота,TelegramId,MessageId = 0)
	
	Если MessageId > 0 Тогда
		
		ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId, MessageId);
	КонецЕсли;
	
	УдалитьПоследнююЗаписьИстории(ИмяБота, TelegramId);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(TelegramИсторияЗапросов.Период), 0) КАК Количество
	|ИЗ
	|	РегистрСведений.TelegramИсторияЗапросов КАК TelegramИсторияЗапросов
	|ГДЕ
	|	TelegramИсторияЗапросов.TelegramId = &TelegramId
	|	И TelegramИсторияЗапросов.ИмяБота = &ИмяБота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	TelegramИсторияЗапросов.Период КАК Период,
	|	TelegramИсторияЗапросов.TelegramId КАК TelegramId,
	|	TelegramИсторияЗапросов.Сообщение КАК Сообщение,
	|	TelegramИсторияЗапросов.Стадия КАК Стадия
	|ИЗ
	|	РегистрСведений.TelegramИсторияЗапросов.СрезПоследних(, TelegramId = &TelegramId) КАК TelegramИсторияЗапросов";
	
	Запрос.УстановитьПараметр("TelegramId", TelegramId);
	Запрос.УстановитьПараметр("ИмяБота", ИмяБота);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка1 = РезультатыЗапроса[0].Выбрать();
	Выборка1.Следующий();
	
	Если Не Выборка1.Количество Тогда
		
		ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, "❌ Запрос был отменен");
		
		НачалоРаботы(ИмяБота, TelegramId);
		Возврат;
	КонецЕсли;
	
	Выборка2 = РезультатыЗапроса[1].Выбрать();
	Выборка2.Следующий();
	
	Сообщение = Выборка2.Сообщение.Получить();
	Стадия    = Выборка2.Стадия;
	
	МенеджерЗаписи = РегистрыСведений.TelegramТекущиеЗапросы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.TelegramId = TelegramId;
	МенеджерЗаписи.ИмяБота = ИмяБота;
	
	Если Выборка1.Количество = 1 Тогда
		
		МенеджерЗаписи.Удалить();
	Иначе
		
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.Стадия = Стадия;
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Сообщение.Свойство("data") Тогда
		
		ВыполнитьИнлайнКомандуБота(ИмяБота, Сообщение);
		
	ИначеЕсли Сообщение.Свойство("text") Тогда
		
		ВыполнитьКомандуБота(ИмяБота, Сообщение);
	КонецЕсли;
	
КонецПроцедуры

Функция ВызовПереходаККоманде(ПереходККоманде)
	
	Параметры = "(";
	Команда = "";
	
	Для Каждого текПараметр Из ПереходККоманде Цикл
		
		Если текПараметр.Ключ = "Команда" Тогда
			
			Команда = текПараметр.Значение;
		Иначе
			
			Параметры = Параметры + "Данные.ПереходККоманде." + текПараметр.Ключ + ",";
		КонецЕсли;
	КонецЦикла; 
	
	Параметры = Лев(Параметры, СтрДлина(Параметры)-1) + ")";
	
	Возврат Команда + Параметры;
КонецФункции

Процедура Помощь(ИмяБота, TelegramId, MessageId, ТекущийЗапрос, Сообщение)
	reply_markup = "";
	//СтрокаИнтернетОтвета = "⭐️ <b> Создать задачу </b>" + Символы.ПС + "Позволяет создать задачу для себя или подчиненного сотрудника."
	//+ Символы.ПС + Символы.ПС + "✅ <b>Работа с задачами</b>" + Символы.ПС + "Управление задачами, здесь можно начать, закончить или завершить задачу."
	//+ Символы.ПС + Символы.ПС + "⏰ <b>Отчет за сегодня</b>" + Символы.ПС + "Позволяет посмотреть реализации за сегодня для себя и подчиненных сотрудников."
	//+ Символы.ПС + Символы.ПС + " <b>Телефон технической поддержки:</b>" + Символы.ПС + "270-02-33."
	//+ Символы.ПС + Символы.ПС + " <b>Подробнее о командах:</b> https://www.youtube.com/watch?v=cauCw2aplUc&feature=youtu.be"; 
	
	СтрокаИнтернетОтвета = "<b>Сайт приложения:</b> https://rwmezex.ru/"
	+ Символы.ПС + Символы.ПС + "<b>Руководство пользователя:</b> https://rwmezex.ru/rukovod"
	+ Символы.ПС + Символы.ПС + "<b>Лицензионное соглашение:</b> https://rwmezex.ru/documents"
	+ Символы.ПС + Символы.ПС + "<b>Инструкция:</b> https://telegra.ph/RemoteWork-07-10"
	+ Символы.ПС + Символы.ПС + "<b>Телефон технической поддержки:</b> <a href=""tel:+73422700233"">+7 (342) 270-02-33</a>";
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("inline_keyboard");
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(ЗаписьJSON, "\ud83d\udd19 Назад", "back");
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	reply_markup = СтрокаJSON;
	ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId);	
	ОтправитьВTelegramText(ИмяБота, TelegramId, 0, СтрокаИнтернетОтвета, reply_markup,Истина);
КонецПроцедуры

#КонецОбласти     

#Область УправлениеСостояниямиДиалогаИОтложеннымиЗапросами  

Процедура ДобавитьВТекущийЗапрос(ИмяБота,TelegramId, Команда, Стадия = 0, Данные = Неопределено, ВремяЖизниЗапроса = 300) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramТекущиеЗапросы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
	ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
	
	Блокировка.Заблокировать();
	МенеджерЗаписи = РегистрыСведений.TelegramТекущиеЗапросы.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.TelegramId        = TelegramId;
	МенеджерЗаписи.Команда           = Команда;
	МенеджерЗаписи.Стадия            = Стадия;
	МенеджерЗаписи.ИмяБота            = ИмяБота;
	МенеджерЗаписи.Данные            = ?(Данные = Неопределено, Новый ХранилищеЗначения(Новый Структура()), Новый ХранилищеЗначения(Данные));
	МенеджерЗаписи.Время             = ТекущаяДатаСеанса();
	МенеджерЗаписи.ВремяЖизниЗапроса = ВремяЖизниЗапроса;
	
	МенеджерЗаписи.Записать(Истина);
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ДобавитьВОтложенныйЗапрос(ПараметрыОтложенногоЗапроса) Экспорт   
	
	ТребуемыеПараметры = Новый Массив;
	
	ТребуемыеПараметры.Добавить("ИмяБота");
	ТребуемыеПараметры.Добавить("TelegramId");
	ТребуемыеПараметры.Добавить("Команда");
	ТребуемыеПараметры.Добавить("ИдентификаторЗапроса");    
	
	ПараметрыПоУмолчанию = Новый ТаблицаЗначений();
	ПараметрыПоУмолчанию.Колонки.Добавить("Параметр");
	ПараметрыПоУмолчанию.Колонки.Добавить("Значение");  
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "Стадия";
	нСтр.Значение = 0;
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "Данные";
	нСтр.Значение = Неопределено;
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "ВремяЖизниЗапроса";
	нСтр.Значение = 300;
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "Сообщение";
	нСтр.Значение = "";
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "MessageId";
	нСтр.Значение = 0;
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "ОтложеннаяОтправка";
	нСтр.Значение = Неопределено;
	
	нСтр = ПараметрыПоУмолчанию.Добавить();
	нСтр.Параметр = "ДанныеОтложеннойОтправки";
	нСтр.Значение = Неопределено;
	
	Для Каждого текПараметр Из ТребуемыеПараметры Цикл
		
		Если Не ПараметрыОтложенногоЗапроса.Свойство(текПараметр)
			Или Не ЗначениеЗаполнено(ПараметрыОтложенногоЗапроса[текПараметр]) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен или отсутсвует параметр "+ текПараметр);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;  
	
	Для Каждого текПараметр Из ПараметрыПоУмолчанию Цикл
		
		Если Не ПараметрыОтложенногоЗапроса.Свойство(текПараметр.Параметр) Тогда
			
			ПараметрыОтложенногоЗапроса.Вставить(текПараметр.Параметр,текПараметр.Значение);
		ИначеЕсли Не ЗначениеЗаполнено(ПараметрыОтложенногоЗапроса[текПараметр.Параметр]) Тогда
			
			ПараметрыОтложенногоЗапроса[текПараметр.Параметр] = текПараметр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыОтложенногоЗапроса.ОтложеннаяОтправка = Неопределено
		Или ПараметрыОтложенногоЗапроса.ОтложеннаяОтправка <= ТекущаяДата() Тогда
		
		ФоновыеЗадания.Выполнить("Telegram.ДобавитьВОтложенныйЗапросСОтправкой",ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОтложенногоЗапроса));
	Иначе
		
		ФоновыеЗадания.Выполнить("Telegram.ДобавитьВОтложенныйЗапросБезОтправки",ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыОтложенногоЗапроса));
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьВОтложенныйЗапросСОтправкой(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.ВремяЖизниЗапроса = Неопределено Тогда
		
		Параметры.ВремяЖизниЗапроса = 300;
	КонецЕсли;  
	
	Если Параметры.ДанныеОтложеннойОтправки = Неопределено Тогда
		
		Возврат;
	КонецЕсли;    
	
	reply_markup = "";
	
	Если Параметры.ДанныеОтложеннойОтправки.Свойство("reply_markup") Тогда
		
		reply_markup = Параметры.ДанныеОтложеннойОтправки.reply_markup;
	ИначеЕсли Параметры.Свойство("reply_markup") Тогда
		
		reply_markup = Параметры.reply_markup;	
	КонецЕсли;
	
	Попытка
		
		MessageId = ОтправитьВTelegramText(Параметры.ИмяБота,Параметры.TelegramId,0,Параметры.Сообщение,reply_markup,Истина);
		
		Если MessageId > 0 Тогда
			
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramОтложенныеЗапросы");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("TelegramId", Параметры.TelegramId);
			ЭлементБлокировки.УстановитьЗначение("ИмяБота", Параметры.ИмяБота);
			
			Блокировка.Заблокировать();  
			
			МенеджерЗаписи = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
			
			МенеджерЗаписи.Данные		= ?(Параметры.Данные = Неопределено, Новый ХранилищеЗначения(Новый Структура()), Новый ХранилищеЗначения(Параметры.Данные));
			
			МенеджерЗаписи.Время		= ТекущаяДата();
			
			МенеджерЗаписи.ДанныеОтложенногоЗапроса = Новый ХранилищеЗначения(Параметры.ДанныеОтложеннойОтправки);
			МенеджерЗаписи.Отправлено	= Ложь;
			
			МенеджерЗаписи.Идентификатор		= Параметры.ИдентификаторЗапроса;
			МенеджерЗаписи.MessageId			= MessageId;   
			МенеджерЗаписи.Отправлено	= Истина;
			
			МенеджерЗаписи.Записать(Истина);
			
			ЗафиксироватьТранзакцию();   
		КонецЕсли;
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьВОтложенныйЗапросБезОтправки(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.ВремяЖизниЗапроса = Неопределено Тогда
		
		Параметры.ВремяЖизниЗапроса = 300;
	КонецЕсли;    
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramОтложенныеЗапросы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("TelegramId", Параметры.TelegramId);
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", Параметры.ИмяБота);
	
	Блокировка.Заблокировать();  
	
	МенеджерЗаписи = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
	
	МенеджерЗаписи.Данные		= ?(Параметры.Данные = Неопределено, Новый ХранилищеЗначения(Новый Структура()), Новый ХранилищеЗначения(Параметры.Данные));
	
	МенеджерЗаписи.Время		= Параметры.ОтложеннаяОтправка;
	
	Если Параметры.ДанныеОтложеннойОтправки = Неопределено Тогда
		
		Возврат;
	Иначе
		
		МенеджерЗаписи.ДанныеОтложенногоЗапроса = Новый ХранилищеЗначения(Параметры.ДанныеОтложеннойОтправки);
		МенеджерЗаписи.Отправлено	= Ложь;
	КонецЕсли; 
	
	МенеджерЗаписи.Идентификатор		= Параметры.ИдентификаторЗапроса;
	МенеджерЗаписи.MessageId			= 0;
	
	МенеджерЗаписи.Записать(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ОчиститьОтложенныйЗапрос(ИмяБота, TelegramId) Экспорт
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramОтложенныеЗапросы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
	ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.TelegramId.Установить(TelegramId);
	НаборЗаписей.Отбор.ИмяБота.Установить(ИмяБота);
	НаборЗаписей.Записать(Истина);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ПолучитьОтложенныйЗапрос(Идентификатор)
	
	Структура = Новый Структура("Команда,Стадия,Данные,ИмяБота,ОтветПользователя,ВремяЖизниЗапроса");
	
	НаборЗаписей = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 1 Тогда
		
		МенеджерЗаписи = НаборЗаписей[0];
		
		Структура.Команда           = МенеджерЗаписи.Команда;
		Структура.Стадия            = МенеджерЗаписи.Стадия;
		Структура.ИмяБота           = МенеджерЗаписи.ИмяБота;
		Структура.Данные            = МенеджерЗаписи.Данные.Получить();
		//Структура.ОтветПользователя = МенеджерЗаписи.ОтветПользователя;	
		Структура.ВремяЖизниЗапроса = МенеджерЗаписи.ВремяЖизниЗапроса;
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	TelegramЗадачиНаПроверке.Задача КАК Задача,
		|	TelegramЗадачиНаПроверке.TelegramId КАК TelegramId,
		|	TelegramЗадачиНаПроверке.ИмяБота КАК ИмяБота,
		|	TelegramЗадачиНаПроверке.ИдентификаторОтложенногоЗапроса КАК ИдентификаторОтложенногоЗапроса,
		|	TelegramЗадачиНаПроверке.ДатаОкончания КАК ДатаОкончания,
		|	TelegramЗадачиНаПроверке.ДатаПроверки КАК ДатаПроверки
		|ИЗ
		|	РегистрСведений.TelegramЗадачиНаПроверке КАК TelegramЗадачиНаПроверке
		|ГДЕ
		|	TelegramЗадачиНаПроверке.ИдентификаторОтложенногоЗапроса = &ИдентификаторОтложенногоЗапроса";
		
		Запрос.УстановитьПараметр("ИдентификаторОтложенногоЗапроса", Идентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			новМенеджер = РегистрыСведений.TelegramЗадачиНаПроверке.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(новМенеджер, ВыборкаДетальныеЗаписи);
			
			новМенеджер.ИдентификаторОтложенногоЗапроса = "";
			новМенеджер.Записать(Истина);
		КонецЦикла;
		
		Возврат Структура;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТекущийЗапрос(TelegramId, ИмяБота) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramТекущиеЗапросы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
	
	Блокировка.Заблокировать();        
	
	МенеджерЗаписи = РегистрыСведений.TelegramТекущиеЗапросы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.TelegramId = TelegramId;
	МенеджерЗаписи.ИмяБота = ИмяБота;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если (ТекущаяДата() - МенеджерЗаписи.Время) > МенеджерЗаписи.ВремяЖизниЗапроса Тогда
			
			МенеджерЗаписи.Удалить();
			
			Telegram.ОчиститьИсториюЗапросов(ИмяБота, TelegramId);
			
			ОтправитьИнформационноеСообщение(TelegramId, "Истекло время ожидания ответа на запрос");
			
			ЗафиксироватьТранзакцию();
			
			Возврат Неопределено;
		КонецЕсли;
		
		Структура = Новый Структура("Команда,Стадия,Данные,ВремяЖизниЗапроса");
		Структура.Команда           = МенеджерЗаписи.Команда;
		Структура.Стадия            = МенеджерЗаписи.Стадия;
		Структура.Данные            = МенеджерЗаписи.Данные.Получить();	
		Структура.ВремяЖизниЗапроса = МенеджерЗаписи.ВремяЖизниЗапроса;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Структура;
	КонецЕсли;
	
	Если ТранзакцияАктивна() Тогда
		
		ОтменитьТранзакцию();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Неопределено;
	
КонецФункции

Процедура УдалитьТекущийЗапрос(ИмяБота, TelegramId) Экспорт
	
	Если Не ИмяБота = null Тогда
		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramТекущиеЗапросы");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
		ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
		
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.TelegramТекущиеЗапросы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.TelegramId = TelegramId;
		МенеджерЗаписи.ИмяБота    = ИмяБота;
		МенеджерЗаписи.Удалить();
		
		ЗафиксироватьТранзакцию();
		
		ОчиститьИсториюЗапросов(ИмяБота, TelegramId);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьОтложенныеЗапросы() Экспорт
	
	Отбор = Новый Структура("ИмяМетода,Состояние", "Telegram.ОбработатьОтложенныеЗапросы", СостояниеФоновогоЗадания.Активно);
	
	КолТекущихФоновыхЗаданий     = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор).Количество();
	
	Если КолТекущихФоновыхЗаданий > 1 Тогда
		
		Возврат;
	КонецЕсли;	
	
	Пока Истина Цикл
		
		Попытка
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	TelegramТекущиеЗапросы.TelegramId КАК TelegramId,
			|	TelegramТекущиеЗапросы.Время КАК Время,
			|	TelegramТекущиеЗапросы.ВремяЖизниЗапроса КАК ВремяЖизниЗапроса,
			|	TelegramПоследнееСообщение.MessageId КАК MessageId,
			|	TelegramПоследнееСообщение.Сообщение КАК Сообщение,
			|	TelegramПоследнееСообщение.ИмяБота КАК ИмяБота
			|ИЗ
			|	РегистрСведений.TelegramТекущиеЗапросы КАК TelegramТекущиеЗапросы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TelegramПоследнееСообщение КАК TelegramПоследнееСообщение
			|		ПО (TelegramТекущиеЗапросы.TelegramId = TelegramПоследнееСообщение.TelegramId
			|				И TelegramТекущиеЗапросы.ИмяБота = TelegramПоследнееСообщение.ИмяБота)";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Время + ВыборкаДетальныеЗаписи.ВремяЖизниЗапроса < ТекущаяДата() Тогда
					
					НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
					
					Блокировка = Новый БлокировкаДанных;
					ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramТекущиеЗапросы");
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					
					ЭлементБлокировки.УстановитьЗначение("TelegramId", ВыборкаДетальныеЗаписи.TelegramId);
					Блокировка.Заблокировать();  
					
					Telegram.УдалитьТекущийЗапрос(ВыборкаДетальныеЗаписи.ИмяБота, ВыборкаДетальныеЗаписи.TelegramId);
					
					МенеджерЗаписи = РегистрыСведений.TelegramПоследнееСообщение.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.TelegramId = ВыборкаДетальныеЗаписи.TelegramId;
					МенеджерЗаписи.ИмяБота = ВыборкаДетальныеЗаписи.ИмяБота;
					
					МенеджерЗаписи.Удалить();
					
					Если Не ВыборкаДетальныеЗаписи.MessageId = NULL Тогда
						
						Если Лев(ВыборкаДетальныеЗаписи.Сообщение,20) = "Что было сделано за " Тогда
							
							// Завершим задачу    
							
							Сотрудник = ПолучитьСотрудникаПоTelegramId(ВыборкаДетальныеЗаписи.TelegramId);
							ДанныеЗадачи = ОбщийСервер.ПолучитьВыполняемуюРаботуБезКомментария(,Сотрудник);
							ОбщийСервер.СтопЗадачи(ДанныеЗадачи.Задача,Сотрудник,"Истекло время ожидания ответа");   
							ОтправитьВTelegramText(ВыборкаДетальныеЗаписи.ИмяБота,ВыборкаДетальныеЗаписи.TelegramId, ВыборкаДетальныеЗаписи.MessageId,"" + ВыборкаДетальныеЗаписи.Сообщение + Символы.ПС + Символы.ПС + "❗ Время ожидания ответа истекло, данные задачи были записаны без комментария. Нажмите /start",,Истина);
						Иначе
							
							ОтправитьВTelegramText(ВыборкаДетальныеЗаписи.ИмяБота,ВыборкаДетальныеЗаписи.TelegramId, ВыборкаДетальныеЗаписи.MessageId,"" + ВыборкаДетальныеЗаписи.Сообщение + Символы.ПС + Символы.ПС + "❗ Время ожидания ответа истекло нажмите /start",,Истина);
						КонецЕсли;					
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
				КонецЕсли;			
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	TelegramОтложенныеЗапросы.MessageId КАК MessageId,
			|	TelegramОтложенныеЗапросы.ИмяБота КАК ИмяБота,
			|	TelegramОтложенныеЗапросы.TelegramId КАК TelegramId,
			|	TelegramОтложенныеЗапросы.Время КАК Время,
			|	TelegramОтложенныеЗапросы.ВремяЖизниЗапроса КАК ВремяЖизниЗапроса,
			|	TelegramОтложенныеЗапросы.Сообщение КАК Сообщение,
			|	TelegramОтложенныеЗапросы.Отправлено КАК Отправлено,
			|	TelegramОтложенныеЗапросы.ДанныеОтложенногоЗапроса КАК ДанныеОтложенногоЗапроса,
			|	TelegramОтложенныеЗапросы.Идентификатор КАК Идентификатор,
			|	TelegramЗадачиНаПроверке.ДатаОкончания КАК ДатаОкончания,
			|	TelegramЗадачиНаПроверке.Задача КАК Задача,
			|	TelegramОтложенныеЗапросы.Команда КАК Команда,
			|	TelegramОтложенныеЗапросы.Попытка КАК Попытка,
			|	TelegramОтложенныеЗапросы.Данные КАК Данные
			|ИЗ
			|	РегистрСведений.TelegramОтложенныеЗапросы КАК TelegramОтложенныеЗапросы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TelegramЗадачиНаПроверке КАК TelegramЗадачиНаПроверке
			|		ПО TelegramОтложенныеЗапросы.Идентификатор = TelegramЗадачиНаПроверке.ИдентификаторОтложенногоЗапроса
			|
			|УПОРЯДОЧИТЬ ПО
			|	Время УБЫВ";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			отлЗапрос = РезультатЗапроса.Выбрать();
			
			Отправленные = Новый Массив;
			
			Пока отлЗапрос.Следующий() Цикл
				
				Если отлЗапрос.Отправлено И отлЗапрос.Время + отлЗапрос.ВремяЖизниЗапроса < ТекущаяДата() Тогда
					
					очистка = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
					очистка.Отбор.ИмяБота.Установить(отлЗапрос.ИмяБота);
					очистка.Отбор.TelegramId.Установить(отлЗапрос.TelegramId);
					очистка.Отбор.MessageId.Установить(отлЗапрос.MessageId);
					очистка.Отбор.Отправлено.Установить(Истина);
					
					очистка.Записать(Истина);
					
					Если отлЗапрос.ДатаОкончания = Дата(1,1,1)  И отлЗапрос.Команда = "ПроверкаИсполненияЗадачи" 
						И Отправленные.Найти(отлЗапрос.Задача) = Неопределено Тогда
						
						// завершим задачу
						Отправленные.Добавить(отлЗапрос.Задача);
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПроделаннаяРаботаСрезПоследних.Задача КАК Задача,
						|	ПроделаннаяРаботаСрезПоследних.Сотрудник КАК Сотрудник,
						|	ПроделаннаяРаботаСрезПоследних.Окончание КАК Окончание,
						|	ПроделаннаяРаботаСрезПоследних.Длительность КАК Длительность,
						|	ПроделаннаяРаботаСрезПоследних.Период КАК Период
						|ИЗ
						|	РегистрСведений.ПроделаннаяРабота.СрезПоследних(
						|			,
						|			Сотрудник = &Сотрудник
						|				И Задача = &Задача) КАК ПроделаннаяРаботаСрезПоследних
						|ГДЕ
						|	ПроделаннаяРаботаСрезПоследних.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
						
						Запрос.УстановитьПараметр("Сотрудник", отлЗапрос.Задача.Исполнитель);
						Запрос.УстановитьПараметр("Задача", отлЗапрос.Задача);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							Если ВыборкаДетальныеЗаписи.Задача = отлЗапрос.Задача Тогда
								
								МенеджерЗаписи = РегистрыСведений.ПроделаннаяРабота.СоздатьМенеджерЗаписи();
								ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаДетальныеЗаписи);
								
								Если ВыборкаДетальныеЗаписи.Период < ТекущаяДата() - 60*45 Тогда
									
									МенеджерЗаписи.Окончание = ТекущаяДата() - 60*45;
								Иначе
									МенеджерЗаписи.Окончание = ВыборкаДетальныеЗаписи.Период + 60;
								КонецЕсли;
								
								МенеджерЗаписи.Записать(Истина);
								
								регистрПроверки = РегистрыСведений.TelegramЗадачиНаПроверке.СоздатьНаборЗаписей();
								регистрПроверки.Отбор.ИмяБота.Установить(отлЗапрос.ИмяБота);
								регистрПроверки.Отбор.TelegramId.Установить(отлЗапрос.TelegramId);
								регистрПроверки.Отбор.Задача.Установить(отлЗапрос.Задача);
								
								регистрПроверки.Прочитать();
								
								Для Каждого СтрокаПроверки Из регистрПроверки Цикл
									
									СтрокаПроверки.ДатаОкончания = ТекущаяДата();
								КонецЦикла;
								
								регистрПроверки.Записать(Истина);
							КонецЕсли;
						КонецЦикла;	
						
						НачатьТранзакцию();     
						
						Ид = ПолучитьИдентификаторОтложенногоЗапроса();
						Данные = отлЗапрос.ДанныеОтложенногоЗапроса.Получить();
						
						СообщениеТг = отлЗапрос.Сообщение + Символы.ПС + Символы.ПС + "❗ Время ожидания ответа истекло, время по задаче было сброшено, вы можете возобновить задачу в течении 3х часов, в следующем сообщении." + Символы.ПС + "В случае если вы запустите другую задачу время останется сброшенным (-45 минут)";
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	TelegramОтложенныеЗапросы.Сообщение КАК Сообщение
						|ИЗ
						|	РегистрСведений.TelegramОтложенныеЗапросы КАК TelegramОтложенныеЗапросы
						|ГДЕ
						|	TelegramОтложенныеЗапросы.Команда ПОДОБНО ""ПроверкаИсполненияЗадачи""
						|	И TelegramОтложенныеЗапросы.TelegramId = &TelegramId
						|	И TelegramОтложенныеЗапросы.ИмяБота = &ИмяБота
						|	И TelegramОтложенныеЗапросы.Отправлено
						|	И TelegramОтложенныеЗапросы.Сообщение ПОДОБНО &СообщениеТг";
						
						Запрос.УстановитьПараметр("TelegramId", отлЗапрос.TelegramId);
						Запрос.УстановитьПараметр("ИмяБота", отлЗапрос.ИмяБота);                           				
						Запрос.УстановитьПараметр("СообщениеТг", СообщениеТг); 
						
						РезультатЗапроса = Запрос.Выполнить();
						
						Если Не РезультатЗапроса.Пустой() Тогда
							
							Продолжить;
						КонецЕсли;					
						
						ОтправитьВTelegramText(отлЗапрос.ИмяБота, отлЗапрос.TelegramId, отлЗапрос.MessageId, СообщениеТг,,Истина);				   			
						
						СтрокаИнтернетОтвета = "&#128293;&#128293;&#128293; Задача была остановлена " + Данные.Задача  + Символы.ПС + Символы.ПС + "<b>Возобновить выполнение задачи?</b>";
						
						ДанныеОтложенногоЗапроса = Новый Структура("СтрокаИнтернетОтвета,reply_markup");
						
						IK = СоздатьInlineKeyboard();
						
						IK.ЗаписатьНачалоМассива();
						ДобавитьInlineКнопку(IK, "✔️ Да","{""cmd"":""stoped_y"",""deffered"":""" + Ид + """}");
						ДобавитьInlineКнопку(IK, "❌ Нет","{""cmd"":""stoped_n"",""deffered"":""" + Ид + """}");
						IK.ЗаписатьКонецМассива();
						
						reply_markup = ЗавершитьInlineKeyboard(IK);
						
						ДанныеОтложенногоЗапроса.СтрокаИнтернетОтвета = СтрокаИнтернетОтвета;
						ДанныеОтложенногоЗапроса.reply_markup = reply_markup;
						
						Параметры = Новый Структура("ИмяБота,TelegramId,Команда,Стадия,Данные,ВремяЖизниЗапроса,Сообщение,ИдентификаторЗапроса,ДанныеОтложеннойОтправки",
						отлЗапрос.ИмяБота,
						отлЗапрос.TelegramId,
						"ПроверкаИсполненияЗадачи",
						1,
						Новый Структура("Задача",Данные.Задача),
						3*3600,
						СообщениеТг,
						Ид,
						ДанныеОтложенногоЗапроса);
						
						ДобавитьВОтложенныйЗапрос(Параметры);			
						ЗафиксироватьТранзакцию();
					Иначе
						
						Если отлЗапрос.Команда = "ПроверкаИсполненияЗадачи" Тогда
							
							// Удалим просроченную на возобновление задачу
							регистрПроверки = РегистрыСведений.TelegramЗадачиНаПроверке.СоздатьНаборЗаписей();
							регистрПроверки.Отбор.ИмяБота.Установить(отлЗапрос.ИмяБота);
							регистрПроверки.Отбор.TelegramId.Установить(отлЗапрос.TelegramId);
							
							регистрПроверки.Прочитать();
							
							регистрПроверки.Очистить();								
							регистрПроверки.Записать(Истина);
						КонецЕсли;
						ОтправитьВTelegramText(отлЗапрос.ИмяБота, отлЗапрос.TelegramId, отлЗапрос.MessageId, отлЗапрос.Сообщение + Символы.ПС + Символы.ПС + "❗ Время ожидания ответа истекло нажмите /start",,Истина);				   			
					КонецЕсли;									
				ИначеЕсли Не отлЗапрос.Отправлено И отлЗапрос.Время < ТекущаяДата() И Отправленные.Найти(отлЗапрос.Задача) = Неопределено Тогда
					
					ДанныеОтложенногоЗапроса = отлЗапрос.ДанныеОтложенногоЗапроса.Получить();
					
					Если отлЗапрос.Команда = "ОтложеннаяЗадача" Тогда
						
						текЗадача = отлЗапрос.Данные.Получить().Задача;
						
						Если текЗадача.Проведен Тогда
							
							РегистрОтложенногоЗапроса = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
							РегистрОтложенногоЗапроса.Отбор.Идентификатор.Установить(отлЗапрос.Идентификатор);
							РегистрОтложенногоЗапроса.Прочитать();
							
							РегистрОтложенногоЗапроса.Очистить();
							РегистрОтложенногоЗапроса.Записать();
							Продолжить;
						КонецЕсли;						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ПроделаннаяРабота.Окончание КАК Окончание
						|ИЗ
						|	РегистрСведений.ПроделаннаяРабота КАК ПроделаннаяРабота
						|ГДЕ
						|	ПроделаннаяРабота.Задача = &Задача
						|	И (НЕ ПроделаннаяРабота.Длительность = ДАТАВРЕМЯ(1, 1, 1)
						|				И НЕ ПроделаннаяРабота.Задача.Проведен
						|			ИЛИ НЕ ПроделаннаяРабота.Задача.Проведен)";
						
						Запрос.УстановитьПараметр("Задача", текЗадача);
						
						Если Не Запрос.Выполнить().Пустой() Тогда
							
							РегистрОтложенногоЗапроса = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
							РегистрОтложенногоЗапроса.Отбор.Идентификатор.Установить(отлЗапрос.Идентификатор);
							РегистрОтложенногоЗапроса.Прочитать();
							
							РегистрОтложенногоЗапроса.Очистить();
							РегистрОтложенногоЗапроса.Записать();
							Продолжить;
						КонецЕсли;
					КонецЕсли;			
					
					MessageId = ОтправитьВTelegramText(отлЗапрос.ИмяБота, отлЗапрос.TelegramId, 0,ДанныеОтложенногоЗапроса.СтрокаИнтернетОтвета,ДанныеОтложенногоЗапроса.reply_markup,Истина,отлЗапрос.Идентификатор,?(отлЗапрос.Попытка > 10,Истина,Ложь));
					
					Если MessageId > 0 Тогда
						
						РегистрОтложенногоЗапроса = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
						РегистрОтложенногоЗапроса.Отбор.Идентификатор.Установить(отлЗапрос.Идентификатор);
						РегистрОтложенногоЗапроса.Прочитать();
						
						Если РегистрОтложенногоЗапроса.Количество() > 0 Тогда
							
							Для Каждого текРегистр Из РегистрОтложенногоЗапроса Цикл
								
								текРегистр.MessageId = MessageId;
								текРегистр.Отправлено = Истина;
							КонецЦикла;
							
							РегистрОтложенногоЗапроса.Записать(Истина);
						КонецЕсли;     
						
						Отправленные.Добавить(отлЗапрос.Задача);
					Иначе
						
						РегистрОтложенногоЗапроса = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
						РегистрОтложенногоЗапроса.Отбор.Идентификатор.Установить(отлЗапрос.Идентификатор);
						РегистрОтложенногоЗапроса.Прочитать();
						
						Если РегистрОтложенногоЗапроса.Количество() = 1 Тогда
							
							РегистрОтложенногоЗапроса[0].Попытка = РегистрОтложенногоЗапроса[0].Попытка + 1;					
							РегистрОтложенногоЗапроса.Записать(Истина);
						КонецЕсли;     										
					КонецЕсли;           			
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Telegram.ОбработатьОтложенныеЗапросы", УровеньЖурналаРегистрации.Информация,,,ОписаниеОшибки());
		КонецПопытки;     
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьОтложенныйЗапрос(Идентификатор)
	
	ОтложенныйЗапрос = РегистрыСведений.TelegramОтложенныеЗапросы.СоздатьНаборЗаписей();
	ОтложенныйЗапрос.Отбор.Отправлено.Установить(Ложь);
	
	ОтложенныйЗапрос.Отбор.Идентификатор.Установить(Идентификатор);
	
	ОтложенныйЗапрос.Записать(Истина);
	
	ПроверкаЗадачи = РегистрыСведений.TelegramЗадачиНаПроверке.СоздатьНаборЗаписей();
	ПроверкаЗадачи.Отбор.ИдентификаторОтложенногоЗапроса.Установить(Идентификатор);
	
	ПроверкаЗадачи.Записать(Истина);	
	
КонецПроцедуры

Процедура ДобавитьОтложенныйЗапросФайлов(Задача,TelegramId) Экспорт
	
	ИмяБота = ПолучитьИмяБота();
	
	ДанныеОтложенногоЗапроса = Новый Структура("СтрокаИнтернетОтвета,reply_markup");
	
	НачатьТранзакцию();     
	
	Ид = ПолучитьИдентификаторОтложенногоЗапроса();
	
	СтрокаИнтернетОтвета = "К задаче " + Задача +  " прикреплены файлы:" + Символы.ПС;
	
	IK = СоздатьInlineKeyboard();
	
	IK.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(IK, "Скачать файлы", "deffered:" + Ид);
	IK.ЗаписатьКонецМассива();
	
	IK.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(IK, "❌ Нет", "cancelquery");
	IK.ЗаписатьКонецМассива();
	
	reply_markup = ЗавершитьInlineKeyboard(IK);
	
	ДанныеОтложенногоЗапроса.СтрокаИнтернетОтвета = СтрокаИнтернетОтвета;
	ДанныеОтложенногоЗапроса.reply_markup = reply_markup;
	
	Параметры = Новый Структура("ИмяБота,TelegramId,Команда,Стадия,Данные,ВремяЖизниЗапроса,Сообщение,ИдентификаторЗапроса,ДанныеОтложеннойОтправки",
	ИмяБота,
	TelegramId,
	"ПросмотрФайлов",
	0,
	Новый Структура("Задача",Задача),
	7200,
	СтрокаИнтернетОтвета,
	Ид,
	ДанныеОтложенногоЗапроса);
	
	ДобавитьВОтложенныйЗапрос(Параметры);	         
	ЗафиксироватьТранзакцию();
	
	
КонецПроцедуры

Функция ПолучитьИдентификаторОтложенногоЗапроса() Экспорт
	
	Пока Истина Цикл
		
		НовыйИдентификатор = Новый УникальныйИдентификатор();		
		НовыйИдентификатор = Лев(СтрЗаменить(Строка(НовыйИдентификатор),"-",""),10);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	TelegramОтложенныеЗапросы.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.TelegramОтложенныеЗапросы КАК TelegramОтложенныеЗапросы
		|ГДЕ
		|	TelegramОтложенныеЗапросы.Идентификатор = &Идентификатор";
		
		Запрос.УстановитьПараметр("Идентификатор", НовыйИдентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			Возврат НовыйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти   

#Область ФормированиеИнтерактивногоИнтерфейса    

Процедура ОткрытьКалендарь(ИмяБота, TelegramId, MessageId, Сообщение, Заголовок = "Выберите дату", ОтображатьТекущееДатуИВремя = Ложь) Экспорт
	
	Если Сообщение = Неопределено Тогда
		
		Сообщение = Новый Структура("cmd,dateStart,date", "calendar", ТекущаяДата() - Дата(1,1,1), ТекущаяДата() - Дата(1,1,1));
	КонецЕсли;
	
	КалендарьТЗ = ОбщийСервер.ПолучитьКалендарьЗаПериод(НачалоДня(Дата(1,1,1) + Макс(Сообщение.dateStart, Сообщение.date)), КонецМесяца(Дата(1,1,1) + Сообщение.date), Истина, Истина);
	
	ЗаписьJSON = СоздатьInlineKeyboard();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	
	Если НачалоМесяца(Дата(1,1,1) + Сообщение.date - 1) < (Дата(1,1,1) + Сообщение.dateStart) Тогда
		
		date = Сообщение.dateStart;
	Иначе
		date = НачалоМесяца(Дата(1,1,1) + Сообщение.date - 1) - Дата(1,1,1);
	КонецЕсли;
	
	ДобавитьInlineКнопку(ЗаписьJSON, "<", JSONДанныеКалендаря("calendar", Сообщение.dateStart, date));
	ДобавитьInlineКнопку(ЗаписьJSON, Формат(Дата(1,1,1) + Сообщение.date, "ДФ='MMM'"), JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
	ДобавитьInlineКнопку(ЗаписьJSON, ">", JSONДанныеКалендаря("calendar", Сообщение.dateStart, КонецМесяца(Дата(1,1,1) + Сообщение.date) + 1 - Дата(1,1,1)));
	
	Если НачалоМесяца(ДобавитьМесяц(Дата(1,1,1) + Сообщение.date, -12)) < (Дата(1,1,1) + Сообщение.dateStart) Тогда
		
		date = Сообщение.dateStart;
	Иначе
		date = НачалоМесяца(ДобавитьМесяц(Дата(1,1,1) + Сообщение.date, -12)) - Дата(1,1,1);
	КонецЕсли;
	
	ДобавитьInlineКнопку(ЗаписьJSON, "<", JSONДанныеКалендаря("calendar", Сообщение.dateStart, date));
	ДобавитьInlineКнопку(ЗаписьJSON, Формат(Дата(1,1,1) + Сообщение.date, "ДФ='yyyy'"), JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
	ДобавитьInlineКнопку(ЗаписьJSON, ">", JSONДанныеКалендаря("calendar", Сообщение.dateStart, НачалоМесяца(ДобавитьМесяц(Дата(1,1,1) + Сообщение.date, 12)) - Дата(1,1,1)));
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	ЗаписьJSON.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(ЗаписьJSON, "Пн", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Вт", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Ср", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Чт", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Пт", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Сб", 0);
	ДобавитьInlineКнопку(ЗаписьJSON, "Вс", 0);
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	НомерНедели = Неопределено;
	МассивДней  = Неопределено;
	
	Для Каждого СтрокаКалендаря Из КалендарьТЗ Цикл
		
		Если Не НомерНедели = (СтрокаКалендаря.НомерНедели - 1) Тогда
			
			Если Не НомерНедели = Неопределено Тогда
				
				Для ДеньНедели = 0 По 6 Цикл
					Если МассивДней[ДеньНедели] = Неопределено Тогда
						
						ДобавитьInlineКнопку(ЗаписьJSON, " ", JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
					Иначе
						
						ДобавитьInlineКнопку(ЗаписьJSON, "" + День(МассивДней[ДеньНедели]), МассивДней[ДеньНедели] - Дата(1,1,1));
					КонецЕсли;
				КонецЦикла;
				
				ЗаписьJSON.ЗаписатьКонецМассива();
			КонецЕсли;
			
			ЗаписьJSON.ЗаписатьНачалоМассива();
			
			МассивДней  = Новый Массив(7);
			НомерНедели = СтрокаКалендаря.НомерНедели - 1;
		КонецЕсли;
		
		МассивДней[СтрокаКалендаря.ДеньНедели - 1] = СтрокаКалендаря.Дата;
	КонецЦикла;
	
	Для ДеньНедели = 0 По 6 Цикл
		Если МассивДней[ДеньНедели] = Неопределено Тогда
			ДобавитьInlineКнопку(ЗаписьJSON, " ", JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
		Иначе
			ДобавитьInlineКнопку(ЗаписьJSON, День(МассивДней[ДеньНедели]), МассивДней[ДеньНедели] - Дата(1,1,1));
		КонецЕсли;
	КонецЦикла;
	
	ЗаписьJSON.ЗаписатьКонецМассива();
	
	Если ОтображатьТекущееДатуИВремя Тогда
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		ДобавитьInlineКнопку(ЗаписьJSON, "Текущая дата и время", JSONДанныеКалендаря("calendar", ТекущаяДата(), ТекущаяДата()));
		ЗаписьJSON.ЗаписатьКонецМассива();
	КонецЕсли;
	
	reply_markup = ДобавитьInlineКнопкуОтменить(ЗаписьJSON);
	
	ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, Заголовок, reply_markup,Истина);
	
КонецПроцедуры

Процедура ОткрытьВремя(ИмяБота, TelegramId, MessageId, Сообщение, Заголовок = "Выберите дату") Экспорт
	
	Если Сообщение = Неопределено Тогда
		
		Сообщение = Новый Структура("cmd,dateStart,date", "calendar", ТекущаяДата() - Дата(1,1,1), ТекущаяДата() - Дата(1,1,1));
	КонецЕсли;
	
	Если Сообщение.cmd = "calendar" Тогда
		
		КалендарьТЗ = ОбщийСервер.ПолучитьКалендарьЗаПериод(НачалоДня(Дата(1,1,1) + Макс(Сообщение.dateStart, Сообщение.date)), КонецМесяца(Дата(1,1,1) + Сообщение.date), Истина, Истина);
		
		ЗаписьJSON = СоздатьInlineKeyboard();
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ДобавитьInlineКнопку(ЗаписьJSON, "<", JSONДанныеКалендаря("calendar", Сообщение.dateStart, НачалоМесяца(Дата(1,1,1) + Сообщение.date - 1) - Дата(1,1,1)));
		ДобавитьInlineКнопку(ЗаписьJSON, Формат(Дата(1,1,1) + Сообщение.date, "ДФ='MMM'"), JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
		ДобавитьInlineКнопку(ЗаписьJSON, ">", JSONДанныеКалендаря("calendar", Сообщение.dateStart, КонецМесяца(Дата(1,1,1) + Сообщение.date) + 1 - Дата(1,1,1)));
		
		ДобавитьInlineКнопку(ЗаписьJSON, "<", JSONДанныеКалендаря("calendar", Сообщение.dateStart, НачалоГода(НачалоГода(Дата(1,1,1) + Сообщение.date) - 1) - Дата(1,1,1)));
		ДобавитьInlineКнопку(ЗаписьJSON, Формат(Дата(1,1,1) + Сообщение.date, "ДФ='yyyy'"), JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
		ДобавитьInlineКнопку(ЗаписьJSON, ">", JSONДанныеКалендаря("calendar", Сообщение.dateStart, КонецГода(Дата(1,1,1) + Сообщение.date) + 1 - Дата(1,1,1)));
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		ДобавитьInlineКнопку(ЗаписьJSON, "Пн", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Вт", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Ср", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Чт", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Пт", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Сб", 0);
		ДобавитьInlineКнопку(ЗаписьJSON, "Вс", 0);
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		НомерНедели = Неопределено;
		МассивДней  = Неопределено;
		
		Для Каждого СтрокаКалендаря Из КалендарьТЗ Цикл
			
			Если Не НомерНедели = (СтрокаКалендаря.НомерНедели - 1) Тогда
				
				Если Не НомерНедели = Неопределено Тогда
					
					Для ДеньНедели = 0 По 6 Цикл
						Если МассивДней[ДеньНедели] = Неопределено Тогда
							
							ДобавитьInlineКнопку(ЗаписьJSON, " ", JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
						Иначе
							
							ДобавитьInlineКнопку(ЗаписьJSON, "" + День(МассивДней[ДеньНедели]), JSONДанныеКалендаря("timing", Сообщение.dateStart, МассивДней[ДеньНедели] - Дата(1,1,1)));
						КонецЕсли;
					КонецЦикла;
					
					ЗаписьJSON.ЗаписатьКонецМассива();
				КонецЕсли;
				
				ЗаписьJSON.ЗаписатьНачалоМассива();
				
				МассивДней  = Новый Массив(7);
				НомерНедели = СтрокаКалендаря.НомерНедели - 1;
			КонецЕсли;
			
			МассивДней[СтрокаКалендаря.ДеньНедели - 1] = СтрокаКалендаря.Дата;
		КонецЦикла;
		
		Для ДеньНедели = 0 По 6 Цикл
			Если МассивДней[ДеньНедели] = Неопределено Тогда
				ДобавитьInlineКнопку(ЗаписьJSON, " ", JSONДанныеКалендаря("calendar", Сообщение.dateStart, Сообщение.date));
			Иначе
				ДобавитьInlineКнопку(ЗаписьJSON, День(МассивДней[ДеньНедели]), JSONДанныеКалендаря("timing", Сообщение.dateStart, МассивДней[ДеньНедели] - Дата(1,1,1)));
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		reply_markup = ДобавитьInlineКнопкуОтменить(ЗаписьJSON);
		
		ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, Заголовок, reply_markup,Истина);
		
	ИначеЕсли Сообщение.cmd = "timing" Тогда
		
		// Дату выбрали, выберем время
		
		ЗаписьJSON = СоздатьInlineKeyboard();
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		ДобавитьInlineКнопку(ЗаписьJSON, Формат(Дата(1,1,1) + Сообщение.date, "ДЛФ=DD"),"back");
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		СчетчикКолонок = 1;
		МассивОткрыт   = Ложь;
		
		Для СчетчикЧасов = 4 По 23 Цикл
			
			Если СчетчикКолонок = 1 И
				Не МассивОткрыт Тогда
				
				МассивОткрыт   = Истина;
				ЗаписьJSON.ЗаписатьНачалоМассива();
			КонецЕсли;
			
			Если ДобавитьКнопкуВремени(Сообщение.dateStart, ЗаписьJSON, Формат(СчетчикЧасов, "ЧЦ=2; ЧВН=") + ":00", Сообщение.date + (СчетчикЧасов * 3600)) Тогда
				
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЕсли;
			
			Если СчетчикКолонок > 4 Тогда 
				
				ЗаписьJSON.ЗаписатьКонецМассива();
				МассивОткрыт = Ложь;
				СчетчикКолонок = 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивОткрыт Тогда
			
			ЗаписьJSON.ЗаписатьКонецМассива();
		КонецЕсли;
		
		reply_markup = ДобавитьОсновныеInlineКнопки(ЗаписьJSON);
		
		ОтправитьВTelegramText(ИмяБота, TelegramId, MessageId, "Выберите время", reply_markup, Истина);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьInlineКнопку(JSON, Text, CallbackData, ОбщаяДлина = 50) Экспорт
	
	// ОбщаяДлина - используем как функцию где понадобится (где может создаваться много кнопок) контролировать ограничение по длине сообщения телеги 4096 символов
	Если ОбщаяДлина > 0 Тогда
		
		ОбщаяДлина = СтрДлина(Text) + СтрДлина(CallbackData) + ОбщаяДлина;
	КонецЕсли;
	
	Если ОбщаяДлина < 3000 Тогда
		
		JSON.ЗаписатьНачалоОбъекта();
		JSON.ЗаписатьИмяСвойства("text");
		JSON.ЗаписатьЗначение(Text);
		JSON.ЗаписатьИмяСвойства("callback_data");
		JSON.ЗаписатьЗначение(CallbackData);
		JSON.ЗаписатьКонецОбъекта();
	КонецЕсли;
	
	Возврат ОбщаяДлина;
	
КонецФункции

Функция JSONДанныеКалендаря(cmd, ДатаНачала = Неопределено, Дата = Неопределено)
	
	Если ДатаНачала = Неопределено Тогда
		
		ДатаНачала = 0;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		
		Дата = 0;
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("cmd");
	ЗаписьJSON.ЗаписатьЗначение(cmd);
	ЗаписьJSON.ЗаписатьИмяСвойства("dateStart");
	ЗаписьJSON.ЗаписатьЗначение(ДатаНачала);
	ЗаписьJSON.ЗаписатьИмяСвойства("date");
	ЗаписьJSON.ЗаписатьЗначение(Дата);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьJSON.Закрыть()
	
КонецФункции

Функция ДобавитьКнопкуВремени(dateStart, ЗаписьJSON, Представление, Время)
	
	Если dateStart < Время Тогда
		
		ДобавитьInlineКнопку(ЗаписьJSON, Представление, Время);
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СоздатьInlineKeyboard() Экспорт
	
	IK = Новый ЗаписьJSON;
	IK.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	IK.ЗаписатьНачалоОбъекта();             
	IK.ЗаписатьИмяСвойства("inline_keyboard");
	IK.ЗаписатьНачалоМассива();
	
	Возврат IK;
	
КонецФункции

Функция ДобавитьОсновныеInlineКнопки(IK = Неопределено) Экспорт
	
	Если IK = Неопределено Тогда
		
		IK = СоздатьInlineKeyboard();
	КонецЕсли;
	
	IK.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(IK, "\ud83d\udd19 Назад", "back");
	ДобавитьInlineКнопку(IK, "↩ В главное меню", "cancelquery");
	IK.ЗаписатьКонецМассива();
	
	Возврат ЗавершитьInlineKeyboard(IK);
	
КонецФункции

Функция ДобавитьInlineКнопкуОтменить(IK = Неопределено) Экспорт
	
	Если IK = Неопределено Тогда
		
		IK = СоздатьInlineKeyboard();
	КонецЕсли;
	
	IK.ЗаписатьНачалоМассива();
	ДобавитьInlineКнопку(IK, "↩ В главное меню", "cancelquery");
	IK.ЗаписатьКонецМассива();
	
	Возврат ЗавершитьInlineKeyboard(IK);
	
КонецФункции

Функция ЗавершитьInlineKeyboard(IK) Экспорт
	
	IK.ЗаписатьКонецМассива();
	IK.ЗаписатьКонецОбъекта();
	
	Возврат IK.Закрыть();
	
КонецФункции

#КонецОбласти

#Область ПриемИОбработкаФайлов  

// Принимает из Telegram файл
//
// Параметры:
//  ИмяБота     - Строка - Имя бота, из которого пришло сообщение
//  Сообщение   - Структура - Сообщение из Telegram
//
// Возвращаемое значение:
//  Структура
//   * ИмяФайла        - Строка
//   * РасширениеФайла - Строка
//   * Данные          - ДвоичныеДанные
//
Функция ПринятьФайл(ИмяБота, Сообщение)
	
	TelegramId = Сообщение.chat.id;
	
	Если Сообщение.Свойство("photo") Тогда
		
		file_id = Сообщение.photo[Сообщение.photo.ВГраница()].file_id; // Самое большое фото
	ИначеЕсли Сообщение.Свойство("document") Тогда
		
		file_id = Сообщение.document.file_id;
	ИначеЕсли Сообщение.Свойство("video") Тогда
		
		file_id = Сообщение.video.file_id;
	ИначеЕсли Сообщение.Свойство("voice") Тогда
		
		file_id = Сообщение.voice.file_id;
	КонецЕсли;
	
	Ресурс     = "bot" + ДанныеБота(ИмяБота).Токен + "/getFile?file_id=" + file_id;
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос     = Новый HTTPЗапрос(Ресурс);
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ТекстовыеДанныеОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ТекстовыеДанныеОтвета);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если НЕ Результат.ok ИЛИ 
		НЕ Результат.result.Свойство("file_path") ИЛИ 
		Результат.result.file_path = "" Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если Сообщение.Свойство("document") Тогда
		
		ИмяФайла        = "Telegram_" + ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Сообщение.document.file_name).ИмяБезРасширения;
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Сообщение.document.file_name).Расширение;
		РасширениеФайла = НРег(?(Лев(РасширениеФайла, 1) = ".", Сред(РасширениеФайла, 2), РасширениеФайла));
		
	ИначеЕсли Сообщение.Свойство("photo") Или
		Сообщение.Свойство("video") Или
		Сообщение.Свойство("voice") Тогда
		
		ИмяФайла        = "Telegram_" + ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Результат.result.file_path).ИмяБезРасширения;
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(Результат.result.file_path).Расширение;
		РасширениеФайла = НРег(?(Лев(РасширениеФайла, 1) = ".", Сред(РасширениеФайла, 2), РасширениеФайла));
	КонецЕсли;
	
	Ресурс     = "file/bot" + ДанныеБота(ИмяБота).Токен + "/" + Результат.result.file_path;
	Соединение = Новый HTTPСоединение(ДанныеБота(ИмяБота).Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос     = Новый HTTPЗапрос(Ресурс);
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ИнформацияОФайле = Новый Структура("ИмяФайла,РасширениеФайла,Данные");
	ИнформацияОФайле.ИмяФайла        = ИмяФайла;
	ИнформацияОФайле.РасширениеФайла = РасширениеФайла;
	ИнформацияОФайле.Данные          = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	Возврат ИнформацияОФайле;
	
КонецФункции

Процедура ВыполнитьОбработкуФайла(ИмяБота, TelegramId, ИнформацияОФайле) Экспорт
	
	Попытка
		
		MessageId = РегистрыСведений.TelegramПоследнееСообщение.ПолучитьMessageId(ИмяБота,TelegramId).MessageId;
		ОтправитьВTelegramDeleteMessage(ИмяБота,TelegramId,MessageId);
		
		ТекущийЗапрос = ПолучитьТекущийЗапрос(TelegramId,ИмяБота);
		Результат = ОбработатьФайл(ИмяБота,TelegramId,ИнформацияОФайле,ТекущийЗапрос);
		
		Если Результат Тогда
			Если ТекущийЗапрос.Команда = "СоздатьЗадачу" Тогда
				СоздатьЗадачу(ИмяБота,TelegramId,MessageId,ТекущийЗапрос,"",ИнформацияОФайле); 
			ИначеЕсли ТекущийЗапрос.Команда = "ЗавершениеЗадачиТП" Тогда
				ЗавершениеЗадачиТП(ИмяБота, TelegramId,MessageId,ТекущийЗапрос,"",ИнформацияОФайле);
			Иначе
				Если ТекущийЗапрос <> Неопределено И
					ЗначениеЗаполнено(ТекущийЗапрос.Команда) Тогда
					
					Выполнить("" + ТекущийЗапрос.Команда + "(ИмяБота, TelegramId, 0, ТекущийЗапрос, Неопределено, Неопределено, ИнформацияОФайле);");  
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		С = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ОтправитьВTelegramText(ИмяБота,TelegramId,0,"❗ При работе с ботом возникла ошибка, запрос был сброшен");
		НачалоРаботы(ИмяБота,TelegramId);
		
		МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
		Сообщение = "";
		
		Для Каждого СообщениеПользователю Из МассивСообщенийПользователю Цикл
			
			Сообщение = Сообщение + СообщениеПользователю.Текст + Символы.ПС;
		КонецЦикла;
		
		Если Не ПустаяСтрока(Сообщение) Тогда
			
			Сообщение = Лев(Сообщение, СтрДлина(Сообщение) - 1);
			ОтправитьВTelegramText(ИмяБота,TelegramId,0, Сообщение);
			ЗаписьЖурналаРегистрации("Telegram.ВыполнитьОбработкуТекста",УровеньЖурналаРегистрации.Ошибка,,,"Сообщение пользователю:" + Символы.ПС + Сообщение);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

// Обработка входящего запроса, в случае если был отправлен файл
// 
// Параметры:   
//  ИмяБота           		- Строка - Краткое внутреннее наименование бота (tec)
//  TelegramId     			- Число - Идентификатор пользователя телеграмм (также является идентификатором чата)
//  ИнформацияОФайле		- Структура - Содержит двоичные данные файла, и данные о файле
//		* ИмяФайла			- Строка - Имя файла
//		* РасширениеФайла	- Данные - Двоичные данные файла
//  ТекущийЗапрос			- Структура - Содержит сохраненные данные, полученные в результате предыдущих запросов пользователя в рамках одной команды
//		* Команда  			- Строка - Наименование команды
//		* Стадия			- Число - Стадия запроса
//		* ИмяБота			- Строка - Имя бота
//		* Данные			- Структура,Строка - Данные, полученные от пользователя (произвольный набор данных)
//
// Возвращаемое значение: 
//  Булево              	- Истина, в случае если файл можно принимать
//							- Ложь, если файл принимать нельзя (не зарегистрирован пользователь или несуществующий запрос)
// 
Функция ОбработатьФайл(ИмяБота, TelegramId, ИнформацияОФайле, ТекущийЗапрос) Экспорт
	
	Зарегистрирован = СотрудникЗарегистрированВTelegram(TelegramId);
	
	Если Не Зарегистрирован Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	ИмяФайла        = ИнформацияОФайле.ИмяФайла;
	РасширениеФайла = ИнформацияОФайле.РасширениеФайла;
	Данные          = ИнформацияОФайле.Данные;
	
	Если ТекущийЗапрос.Данные.Свойство("ДанныеЗадачиТехПоддержки") И ТекущийЗапрос.Данные.ДанныеЗадачиТехПоддержки.Свойство("Задача") Тогда
		
		IDФайла = ФайлыСервер.Записать(ТекущийЗапрос.Данные.ДанныеЗадачиТехПоддержки.Задача,Данные,ИмяФайла,РасширениеФайла,0,Ложь,ПараметрыСеанса.Сотрудник);
	ИначеЕсли ТекущийЗапрос.Данные.Свойство("Задача") Тогда	 
		
		Если ЗначениеЗаполнено(ТекущийЗапрос.Данные.Задача) Тогда
			
			IDФайла = ФайлыСервер.Записать(ТекущийЗапрос.Данные.Задача,Данные,ИмяФайла,РасширениеФайла,0,Ложь,ПараметрыСеанса.Сотрудник); 
		Иначе
			
			IDФайла = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		КонецЕсли;
	Иначе
		IDФайла = ФайлыСервер.Записать(ПараметрыСеанса.Сотрудник,Данные,ИмяФайла,РасширениеФайла,0,Ложь,ПараметрыСеанса.Сотрудник);
	КонецЕсли;                    
	
	Если IDФайла = Неопределено Тогда 		
		
		СтрокаИнтернетОтвета = "❗ Не удалось загрузить файл";
	Иначе
		СтрокаИнтернетОтвета = "✌ Файл " + ИмяФайла + "." + РасширениеФайла + " успешно отправлен"; 
		ИнформацияОФайле.Вставить("IDФайла",IDФайла);
	КонецЕсли;                    
	
	ОтправитьВTelegramText(ИмяБота,TelegramId,0,СтрокаИнтернетОтвета);
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоФайл(Данные) Экспорт
	
	Если НЕ ТипЗнч(Данные) = Тип("Структура") ИЛИ
		НЕ Данные.Свойство("ИмяФайла") ИЛИ
		НЕ Данные.Свойство("РасширениеФайла") ИЛИ
		НЕ Данные.Свойство("Данные") Тогда
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область РегистрацияИдентификацияПользователя    

Процедура Зарегистрироваться(ИмяБота, TelegramId, MessageId, ТекущийЗапрос = Неопределено, Сообщение = Неопределено)
	
	СтрокаИнтернетОтвета = "";
	Reply_markup = "";
	РедактируемоеСообщение = 0;
	
	КомандаЗавершена = Ложь;
	
	Данные = Новый Структура("phone, name, agreement, resultregistation, conf_code");
	
	Если НЕ ТекущийЗапрос = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Данные, ТекущийЗапрос.Данные);
	КонецЕсли;
	
	Если ТекущийЗапрос = Неопределено Тогда
		
		ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "Зарегистрироваться", 1, Данные);
		СтрокаИнтернетОтвета = "Как к Вам можно обращаться?";
		РедактируемоеСообщение = MessageId;
	ИначеЕсли ТекущийЗапрос.Стадия = 1 Тогда
		Данные.name = Сообщение.text;
		
		ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "Зарегистрироваться", 2, Данные);
		СтрокаИнтернетОтвета = "Отправьте свой номер телефона";
		
	ИначеЕсли ТекущийЗапрос.Стадия = 2 Тогда
		
		Если Сообщение.Свойство("entities") И Сообщение.entities[0].type = "phone_number" Тогда
			
			Данные.phone = Сообщение.text;
			
			ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "Зарегистрироваться", 3, Данные);
			
			ПринятьРешениеОРегистрацииПользователяВСистеме(ИмяБота, TelegramId, MessageId, Данные);
			
			ТекущийЗапрос.Стадия = 3;
			ТекущийЗапрос.Данные = Данные;
			Зарегистрироваться(ИмяБота, TelegramId, 0, ТекущийЗапрос);
			
		Иначе // телега не распознала номер телефона
			СтрокаИнтернетОтвета = "Номер телефона введен некорректно! Повторите ввод";
		КонецЕсли;
		
	ИначеЕсли ТекущийЗапрос.Стадия = 3 Тогда
		
		ОтправитьКодПодтверждения(Данные);
		
		Если ОбщийСерверПовтИсп.ЭтоНеРабочаяБаза() Тогда
			
			СтрокаИнтернетОтвета = "Введите код подтверждения ("+Данные.conf_code+")";
		Иначе
			
			СтрокаИнтернетОтвета = "Введите код подтверждения";
		КонецЕсли;
		
		ДобавитьВТекущийЗапрос(ИмяБота, TelegramId, "Зарегистрироваться", 4, Данные, 60*10);
		
		РедактируемоеСообщение = MessageId;
		
	ИначеЕсли ТекущийЗапрос.Стадия = 4 Тогда
		
		ВведенныйКодСовпадает = Ложь;
		ПроверитьВведенныйКодПодтверждения(Сообщение.text, ВведенныйКодСовпадает, Данные.conf_code);
		Если ВведенныйКодСовпадает Тогда
			ТекущийЗапрос.Данные = Данные;
			ТекущийЗапрос.Стадия = 4;
			
			//СтрокаИнтернетОтвета = СериализоватьВJSON(ТекущийЗапрос.Данные);
			
			НачатьТранзакцию();
			Попытка
				Справочники.Пользователи.СоздатьПользователя(
				Новый Структура("ПолнНаименование, TelegramId, НомерТелефона",
				Данные.name,
				TelegramId,
				Данные.phone));
				ЗафиксироватьТранзакцию();
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("ПроцедураРегистрации", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			КонецПопытки;
			
			КомандаЗавершена = Истина;
			
		Иначе
			СтрокаИнтернетОтвета = "Код подтверждения неверный! Повторите ввод.";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СтрокаИнтернетОтвета) тогда
		ОтправитьВTelegramText(ИмяБота, TelegramId, РедактируемоеСообщение, СтрокаИнтернетОтвета, Reply_markup);
	КонецЕсли;
	
	Если КомандаЗавершена Тогда
		
		НачалоРаботы(ИмяБота, TelegramId);
	КонецЕсли;
	
	
КонецПроцедуры

Функция НайтиБотаПоТокену(Токен) Экспорт
	
	Если Токен = "токен" Тогда
		
		Возврат "названиебота";
				
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СотрудникЗарегистрированВTelegram(TelegramId)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ разрешенные
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Архивный
	|	И Сотрудники.TelegramId = &TelegramId";
	
	Запрос.УстановитьПараметр("TelegramId", TelegramId);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ПараметрыСеанса.Сотрудник <> Выборка.Ссылка Тогда
			
			ПараметрыСеанса.Сотрудник = Выборка.Ссылка;
			
			ПараметрыСеанса.ТекущееПространство = РегистрыСведений.TelegramТекущееПространство.ПолучитьТекущееПространствоПользователя(TelegramId);
			
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПользователя(Свойство, Сотрудник = Неопределено)
	
	Если Сотрудник = Неопределено Тогда
		Сотрудник = ПараметрыСеанса.Сотрудник;
	КонецЕсли;
	
	ПрименятьРазделениеПоПространствам = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство, "ПрименятьРазделениеПоПространствам") = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваСотрудника.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.СвойстваСотрудника КАК СвойстваСотрудника
	|ГДЕ
	|	СвойстваСотрудника.Свойство = &Свойство
	|	И СвойстваСотрудника.Свойство.ДляБота
	|	И СвойстваСотрудника.Сотрудник = &Сотрудник";
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Если ПрименятьРазделениеПоПространствам Тогда
		Запрос.Текст = запрос.Текст + " И СвойстваСотрудника.Пространство = &Пространство";
		Запрос.УстановитьПараметр("Пространство", ПараметрыСеанса.ТекущееПространство);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		ЗначениеПоУмолчанию = ПланыВидовХарактеристик.СвойстваСотрудника[Свойство.ИмяПредопределенныхДанных].ТипЗначения.ПривестиЗначение();
		
		НоваяЗапись = РегистрыСведений.СвойстваСотрудника.СоздатьМенеджерЗаписи();
		НоваяЗапись.Пространство = ?(ПрименятьРазделениеПоПространствам, ПараметрыСеанса.ТекущееПространство, Справочники.РабочиеПространства.ПустаяСсылка());
		НоваяЗапись.Сотрудник = Сотрудник;
		НоваяЗапись.Свойство = Свойство;
		НоваяЗапись.Значение = ЗначениеПоУмолчанию;
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.Записать();
		
		Возврат ЗначениеПоУмолчанию;
		
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Значение;
		
	КонецЕсли;
	
КонецФункции

Функция ДанныеБота(ИмяБота)
	
	Структура = Новый Структура("Бот,Токен,Сервер");
	
	Если ОбщийСерверПовтИсп.ЭтоТестоваяБаза() Тогда
		
		Структура.Бот    = "названиебота";
		Структура.Токен  = "токен";
		Структура.Сервер = "api.telegram.org";
		КонецЕсли;
	
	Возврат Структура;
	
КонецФункции  

Функция ПолучитьИмяБота() Экспорт
	
	Возврат "названиебота";
	
КонецФункции

Функция ПолучитьСотрудникаПоTelegramId(TelegramId)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Разрешенные
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.Архивный
	|	И Сотрудники.TelegramId = &TelegramId";
	
	Запрос.УстановитьПараметр("TelegramId", TelegramId);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОтправитьКодПодтверждения(Данные)  
	
	Данные.conf_code = СгенерироватьКод(4);  
	ТекстСообщения = "Для подтверждения введите "+ Данные.conf_code;
	
	Если Константы.Api_Использовать.Получить() Тогда
		
		Api_Requests.ОтправитьЗапросAPI(Константы.Api_ИмяСервисаДляИнтеграции.Получить(),"send_sms",Новый Структура("phone,message",Данные.phone, ТекстСообщения));	                                           
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВведенныйКодПодтверждения(Код, результат, ОтправленныйКод)
	
	результат = СокрЛП(Код) = ОтправленныйКод;
	
КонецПроцедуры

Процедура ПринятьРешениеОРегистрацииПользователяВСистеме(ИмяБота, TelegramId, MessageId, Данные)
	
	// если попали сюда, значит пользователя по текущему tg_id нет в базе
	ТелефонВФормате = РаботаСТелефонами.ФорматНомераТелефона(Данные.phone, Истина, Истина);
	
	Данные.phone = ТелефонВФормате;
	
	ПользовательПоНомеруТелефона = РаботаСТелефонами.ПолучитьПользователяПоНомеруТелефона(ТелефонВФормате);
	
	Если ПользовательПоНомеруТелефона = Неопределено Тогда
		
		Данные.resultregistation = "СоздатьПользователя";
		
	Иначе
		
		СтрокаИнтернетОтвета = "К введенному номеру телефона уже привязан пользователь с другим телеграм аккаунтом, обратитесь в техническую поддержку приложения.";
		
		ОтправитьВTelegramText(ИмяБота, TelegramId, 0, СтрокаИнтернетОтвета);
		
		Данные.resultregistation = "ТехническаяПоддержка";
		
	КонецЕсли;
	
КонецПроцедуры

Функция СгенерироватьКод(ДлинаКода)
	
	ГенераторЧисел = Новый ГенераторСлучайныхЧисел;
	Код = "";
	
	Для Счет = 1 по ДлинаКода Цикл
		Код = Код + Строка(ГенераторЧисел.СлучайноеЧисло(0, 9));
	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

#КонецОбласти

#Область ЖурналированиеИсторииИПоследнееСообщение 

Процедура ДобавитьВИсториюЗапросов(ИмяБота,Сообщение) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.TelegramИсторияЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период  = ТекущаяДата();
	МенеджерЗаписи.ИмяБота = ИмяБота; 
	
	Если Сообщение.Свойство("callback_query") Тогда
		
		Если Сообщение.callback_query.data = "back" Или
			Сообщение.callback_query.data = "cancel" Тогда
			
			Возврат;
		КонецЕсли;
		
		МенеджерЗаписи.TelegramId = Сообщение.callback_query.from.id;
		МенеджерЗаписи.Сообщение  = Новый ХранилищеЗначения(Сообщение.callback_query);
		
	ИначеЕсли Сообщение.Свойство("message") И
		Сообщение.message.Свойство("text") Тогда
		
		МенеджерЗаписи.TelegramId = Сообщение.message.chat.id;
		МенеджерЗаписи.Сообщение  = Новый ХранилищеЗначения(Сообщение.message);
	Иначе
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TelegramТекущиеЗапросы.Стадия КАК Стадия
	|ИЗ
	|	РегистрСведений.TelegramТекущиеЗапросы КАК TelegramТекущиеЗапросы
	|ГДЕ
	|	TelegramТекущиеЗапросы.TelegramId = &TelegramId
	|	И TelegramТекущиеЗапросы.ИмяБота = &ИмяБота";
	
	Запрос.УстановитьПараметр("TelegramId", МенеджерЗаписи.TelegramId);
	Запрос.УстановитьПараметр("ИмяБота", МенеджерЗаписи.ИмяБота);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МенеджерЗаписи.Стадия = Выборка.Стадия;
	КонецЕсли;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьИсториюЗапросов(ИмяБота, TelegramId) Экспорт
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramИсторияЗапросов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
	
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.TelegramИсторияЗапросов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяБота.Установить(ИмяБота);
	НаборЗаписей.Отбор.TelegramId.Установить(TelegramId);
	НаборЗаписей.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура УдалитьПоследнююЗаписьИстории(ИмяБота, TelegramId) Экспорт
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.TelegramИсторияЗапросов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки.УстановитьЗначение("TelegramId", TelegramId);
	ЭлементБлокировки.УстановитьЗначение("ИмяБота", ИмяБота);
	
	Блокировка.Заблокировать();         
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TelegramИсторияЗапросов.Период КАК Период,
	|	TelegramИсторияЗапросов.TelegramId КАК TelegramId,
	|	TelegramИсторияЗапросов.ИмяБота КАК ИмяБота
	|ИЗ
	|	РегистрСведений.TelegramИсторияЗапросов.СрезПоследних(
	|			,
	|			TelegramId = &TelegramId
	|				И ИмяБота = &ИмяБота) КАК TelegramИсторияЗапросов";
	
	Запрос.УстановитьПараметр("TelegramId", TelegramId);
	Запрос.УстановитьПараметр("ИмяБота", ИмяБота);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.TelegramИсторияЗапросов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
	МенеджерЗаписи.Удалить();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ПолучитьПоследнееСообщение(ИмяБота, TelegramId) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TelegramПоследнееСообщение.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.TelegramПоследнееСообщение КАК TelegramПоследнееСообщение
	|ГДЕ
	|	TelegramПоследнееСообщение.TelegramId = &TelegramId
	|	И TelegramПоследнееСообщение.ИмяБота = &ИмяБота";
	
	Запрос.УстановитьПараметр("TelegramId", TelegramId);
	Запрос.УстановитьПараметр("ИмяБота", ИмяБота);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.Сообщение; 
	КонецЦикла;                                
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции              

Процедура УдалитьИзМассива(Значение, Массив)
	
	Индекс = Массив.Найти(Значение);
	Если НЕ Индекс = Неопределено Тогда
		Массив.УДалить(Индекс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьВМассив(Значение, Массив)
	
	Индекс = Массив.Найти(Значение);
	Если Индекс = Неопределено Тогда
		Массив.Добавить(Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗнакОперцииНастройкиСписка(Действие)
	
	с = Новый Соответствие;
	с.Вставить("add", "➕");
	с.Вставить("del", "➖");
	Возврат с.Получить(Действие);
	
КонецФункции

Функция ЗаменитьСкобкиНаСлова2(знач Строка) Экспорт 
	
	Строка = СтрЗаменить(Строка,"<b>","{b}");
	Строка = СтрЗаменить(Строка,"</b>","{/b}");
	Строка = СтрЗаменить(Строка,"<a","{a");
	Строка = СтрЗаменить(Строка,"</a>","{/a}");
	Строка = СтрЗаменить(Строка,"<i>","{i}");
	Строка = СтрЗаменить(Строка,"</i>","{/i}");
	Строка = СтрЗаменить(Строка,"<code>","{code}");
	Строка = СтрЗаменить(Строка,"</code>","{/code}");
	Строка = СтрЗаменить(Строка,"<s>","{s}");
	Строка = СтрЗаменить(Строка,"</s>","{/s}");
	Строка = СтрЗаменить(Строка,"<u>","{u}");
	Строка = СтрЗаменить(Строка,"</u>","{/u}");
	Строка = СтрЗаменить(Строка,"<pre","{pre");
	Строка = СтрЗаменить(Строка,"</pre>","{/pre}");
	
	Строка = СтрЗаменить(Строка,"<>","\<\\>\");	                   
	Строка = СтрЗаменить(Строка,"<=","\<\=");	                   
	Строка = СтрЗаменить(Строка,"=>","=\>\");	                   
	Строка = СтрЗаменить(Строка,">","\>\");	                   
	Строка = СтрЗаменить(Строка,"<","\<\");	                   
	
	Строка = СтрЗаменить(Строка,"{b}","<b>");
	Строка = СтрЗаменить(Строка,"{/b}","</b>");
	Строка = СтрЗаменить(Строка,"{a","<a");
	Строка = СтрЗаменить(Строка,"{/a}","</a>");
	Строка = СтрЗаменить(Строка,"{i}","<i>");
	Строка = СтрЗаменить(Строка,"{/i}","</i>");
	Строка = СтрЗаменить(Строка,"{code}","<code>");
	Строка = СтрЗаменить(Строка,"{/code}","</code>");
	Строка = СтрЗаменить(Строка,"{s}","<s>");
	Строка = СтрЗаменить(Строка,"{/s}","</s>");
	Строка = СтрЗаменить(Строка,"{u}","<u>");
	Строка = СтрЗаменить(Строка,"{/u}","</u>");
	Строка = СтрЗаменить(Строка,"{pre","<pre");
	Строка = СтрЗаменить(Строка,"{/pre}","</pre>");
	
	Возврат Строка; 
	
КонецФункции

Функция ЗаменитьСкобкиНаСлова(знач Строка) Экспорт
	
	Строка = СтрЗаменить(Строка,"<b>","{b}");
	Строка = СтрЗаменить(Строка,"</b>","{/b}");
	Строка = СтрЗаменить(Строка,"<a","{a");
	Строка = СтрЗаменить(Строка,"</a>","{/a}");
	Строка = СтрЗаменить(Строка,"<i>","{i}");
	Строка = СтрЗаменить(Строка,"</i>","{/i}");
	Строка = СтрЗаменить(Строка,"<code>","{code}");
	Строка = СтрЗаменить(Строка,"</code>","{/code}");
	Строка = СтрЗаменить(Строка,"<s>","{s}");
	Строка = СтрЗаменить(Строка,"</s>","{/s}");
	Строка = СтрЗаменить(Строка,"<u>","{u}");
	Строка = СтрЗаменить(Строка,"</u>","{/u}");
	Строка = СтрЗаменить(Строка,"<pre","{pre");
	Строка = СтрЗаменить(Строка,"</pre>","{/pre}");
	
	Строка = СтрЗаменить(Строка,"<>"," {b}не равно{/b} ");	                   
	Строка = СтрЗаменить(Строка,"<="," {b}меньше или равно{/b} ");	                   
	Строка = СтрЗаменить(Строка,"=>"," {b}больше или равно{/b} ");	                   
	Строка = СтрЗаменить(Строка," >"," {b}больше{/b} ");	                   
	Строка = СтрЗаменить(Строка,"< "," {b}меньше{/b} ");	                   
	
	Строка = СтрЗаменить(Строка,"{b}","<b>");
	Строка = СтрЗаменить(Строка,"{/b}","</b>");
	Строка = СтрЗаменить(Строка,"{a","<a");
	Строка = СтрЗаменить(Строка,"{/a}","</a>");
	Строка = СтрЗаменить(Строка,"{i}","<i>");
	Строка = СтрЗаменить(Строка,"{/i}","</i>");
	Строка = СтрЗаменить(Строка,"{code}","<code>");
	Строка = СтрЗаменить(Строка,"{/code}","</code>");
	Строка = СтрЗаменить(Строка,"{s}","<s>");
	Строка = СтрЗаменить(Строка,"{/s}","</s>");
	Строка = СтрЗаменить(Строка,"{u}","<u>");
	Строка = СтрЗаменить(Строка,"{/u}","</u>");
	Строка = СтрЗаменить(Строка,"{pre","<pre");
	Строка = СтрЗаменить(Строка,"{/pre}","</pre>");
	
	Возврат Строка; 
	
КонецФункции

#КонецОбласти
