#Область ОбработчикиСобытий

Функция ПолучитьСообщениеPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Сообщение = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(Сообщение) Тогда
		
		ЗаписьЖурналаРегистрации("ApiДляСайта.ПолучитьСообщениеИзTelegramPOST", УровеньЖурналаРегистрации.Ошибка,,,"Пустое сообщение");
		Возврат Ответ;
	КонецЕсли;
	
	Поз = СтрНайти(Сообщение, "-{");
	
	Если Поз = 0 Тогда
		
		ЗаписьЖурналаРегистрации("ApiДляСайта.ПолучитьСообщениеИзTelegramPOST", УровеньЖурналаРегистрации.Ошибка,,,"Токен не найден" + Символы.ПС + Сообщение);
		Возврат Ответ;
	КонецЕсли;
		
	Токен = Лев(Сообщение, Поз - 1);
	
	Сообщение = Сред(Сообщение, Поз + 1);
	
	ИмяБота = Telegram.НайтиБотаПоТокену(Токен);
	
	Если ИмяБота = Неопределено Тогда
		
		ЗаписьЖурналаРегистрации("ApiДляСайта.ПолучитьСообщениеИзTelegramPOST", УровеньЖурналаРегистрации.Ошибка,,,"Бот не найден" + Символы.ПС + Сообщение);
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		СообщениеСтруктурой = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ИмяБота);
		МассивПараметров.Добавить(СообщениеСтруктурой);
		
		ФоновыеЗадания.Выполнить("Telegram.ПрочитатьСообщениеTelegram", МассивПараметров);
	Исключение
		
		СообщениеОбОшибке = Сообщение + Символы.ПС + Символы.ПС + ОписаниеОшибки();
		
		Telegram.ОтправитьИнформационноеСообщение(511985368,"Подробности ошибки: "+ ИмяБота + Символы.ПС + СообщениеОбОшибке);
		ЗаписьЖурналаРегистрации("ApiДляСайта.ПолучитьСообщениеИзTelegramPOST", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
